Repository: ros2/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Contact.po
Languages: es

source: Contact
es: Contacto

source: Support
es: Soporte

source: Different types of questions or discussions correspond to different avenues of communication; check the descriptions below to ensure you choose the right method.
es: Diferentes tipos de preguntas o discusiones corresponden a diferentes vías de comunicación; revise las descripciones a continuación para asegurarse de elegir el método correcto.

source: Need help troubleshooting your system? First, search `ROS Answers <https://answers.ros.org>`__ to see if others have had similar issues, and if their solution works for you.
es: ¿Necesita ayuda para solucionar problemas en su sistema? Primero, busque en `ROS Answers <https://answers.ros.org>`__ para ver si otros han tenido problemas similares, y si su solución funciona para usted.

source: If not, ask a new question on `ROS Answers <https://answers.ros.org>`__. Make sure to add tags, at the very least the ``ros2`` tag and the distro version you are running, e.g. ``{DISTRO}``. If your question is related to the documentation here, add a tag like ``docs``, or more specifically, ``tutorials``.
es: Si no, haga una nueva pregunta en `ROS Answers <https://answers.ros.org>`__. Asegúrese de agregar etiquetas, al menos la etiqueta ``ros2`` y la versión de distribución que está ejecutando, por ejemplo ``{DISTRO}``. Si su pregunta está relacionada con la documentación aquí, agregue una etiqueta como ``docs``, o más específicamente, ``tutorials``.

source: Contributing support
es: Contribuir con soporte

source: ROS 2 users come from a wide range of technical backgrounds, use a variety of different operating systems, and don’t necessarily have any prior experience with ROS (1 or 2). So, it's important for users with any amount of experience to contribute support.
es: Los usuarios de ROS 2 provienen de una amplia gama de antecedentes técnicos, utilizan una variedad de sistemas operativos diferentes y no necesariamente tienen experiencia previa con ROS (1 o 2). Por lo tanto, es importante que los usuarios con cualquier cantidad de experiencia contribuyan con soporte.

source: If you see an issue on `ROS Answers <https://answers.ros.org/questions/tags:ros2/>`__ that is similar to something you’ve run into yourself, please consider providing some pointers to what helped in your situation. Don’t worry if you aren't sure if your response is correct. Simply say so, and other community members will jump in if necessary.
es: Si ve un problema en `ROS Answers <https://answers.ros.org/questions/tags:ros2/>`__ que es similar a algo con lo que se ha encontrado, considere proporcionar algunos consejos sobre lo que ayudó en su situación. No se preocupe si no está seguro de que su respuesta sea correcta. Simplemente dígalo, y otros miembros de la comunidad intervendrán si es necesario.

source: Issues
es: Problemas

source: If you identify bugs, have suggestions for improvements, or a question specific to one package, you can open an issue on GitHub.
es: Si identifica errores, tiene sugerencias para mejoras o una pregunta específica para un paquete, puede abrir un issue en GitHub.

source: For example, if you are following the :doc:`tutorials here <Tutorials>` and come across an instruction that doesn't work on your system, you can open an issue in the `ros2_documentation <https://github.com/ros2/ros2_documentation>`__ repo.
es: Por ejemplo, si está siguiendo los :doc:`tutoriales aquí <Tutorials>` y encuentra una instrucción que no funciona en su sistema, puede abrir un issue en el repositorio `ros2_documentation <https://github.com/ros2/ros2_documentation>`__.

source: You can search for individual ROS 2 repositories on `ROS 2's GitHub <https://github.com/ros2>`__.
es: Puede buscar repositorios individuales de ROS 2 en `GitHub de ROS 2 <https://github.com/ros2>`__.

source: Before opening an issue, check if other users have reported similar issues by searching across the ros2 and ament GitHub organizations: `example search query <https://github.com/search?q=user%3Aros2+user%3Aament+turtlesim&type=Issues>`__.
es: Antes de abrir un issue, verifique si otros usuarios han reportado problemas similares buscando en las organizaciones de GitHub ros2 y ament: `ejemplo de consulta de búsqueda <https://github.com/search?q=user%3Aros2+user%3Aament+turtlesim&type=Issues>`__.

source: Next, check `ROS Answers <https://answers.ros.org/>`__ to see if someone else has asked your question or reported your issue.
es: A continuación, verifique `ROS Answers <https://answers.ros.org/>`__ para ver si alguien más ha hecho su pregunta o ha reportado su problema.

source: If it has not been reported, feel free to open an issue in the appropriate repository tracker. If it's not clear which tracker to use for a particular issue, file it in the `ros2/ros2 repository <https://github.com/ros2/ros2/issues>`__ and we'll have a look at it.
es: Si no se ha reportado, no dude en abrir un issue en el rastreador del repositorio correspondiente. Si no está claro qué rastreador usar para un problema en particular, regístrelo en el repositorio `ros2/ros2 <https://github.com/ros2/ros2/issues>`__ y lo revisaremos.

source: When filing an issue, please make sure to:
es: Cuando registre un issue, asegúrese de:

source: Include enough information for another person to understand the issue.
es: Incluya suficiente información para que otra persona entienda el issue.

source: Describe exactly what you were doing or are trying to do, and exactly what, if anything, went wrong. If following a tutorial or online instructions provide a link to the specific instructions.
es: Describa exactamente lo que estaba haciendo o está intentando hacer, y exactamente qué, si algo, salió mal. Si sigue un tutorial o instrucciones en línea, proporcione un enlace a las instrucciones específicas.

source: Use a descriptive headline or subject line. Bad: "rviz doesn't work". Good: "Rviz crashing looking for missing .so after latest apt update"
es: Use un título descriptivo o una línea de asunto. Malo: "rviz no funciona". Bueno: "Rviz se bloquea buscando .so faltante después de la última actualización de apt"

source: Include information about the exact platform, software, versions, and environment relevant to the problem. This includes how you installed the software (from binaries or from source) and which ROS middleware/DDS vendor you are using (if you know it).
es: Incluya información sobre la plataforma, el software, las versiones y el entorno exactos relevantes para el problema. Esto incluye cómo instaló el software (desde binarios o desde la fuente) y qué middleware/DDS de ROS está utilizando (si lo sabe).

source: Any warnings or errors. Cut and paste them directly from the terminal window to which they were printed. Please do not re-type or include a screenshot.
es: Cualquier advertencia o error. Cópielos y péguelos directamente desde la ventana de terminal a la que se imprimieron. No vuelva a escribirlos ni incluya una captura de pantalla.

source: In case of a bug consider providing a `short, self contained, correct (compilable), example <http://sscce.org/>`__.
es: En caso de un error, considere proporcionar un `ejemplo corto, autocontenido y correcto (compilable) <http://sscce.org/>`__.

source: When discussing any compiling/linking/installation issues, also provide the compiler version
es: Al discutir cualquier problema de compilación/enlace/instalación, también proporcione la versión del compilador

source: As appropriate, also include your:
es: Según corresponda, también incluya su:

source: ROS environment variables (env | grep ROS)
es: Variables de entorno de ROS (env | grep ROS)

source: Relevant config files
es: Archivos de configuración relevantes

source: Graphics card model and driver version
es: Modelo de tarjeta gráfica y versión del controlador

source: Ogre.log for rviz, if possible (run with rviz -l)
es: Ogre.log para rviz, si es posible (ejecute con rviz -l)

source: Bag files and code samples that can reproduce the problem
es: Archivos Bag y muestras de código que puedan reproducir el problema

source: Gifs or movies to demonstrate the problem
es: Gifs o videos para demostrar el problema

source: When you feel comfortable enough to suggest a specific change directly to the code, you can submit a pull request. Pull requests are welcome for any of `the ros2 repositories <https://github.com/ros2>`__. See the :doc:`Contributing <The-ROS2-Project/Contributing>` page for more details and etiquette on how to contribute.
es: Cuando se sienta lo suficientemente cómodo como para sugerir un cambio específico directamente al código, puede enviar un pull request. Los pull requests son bienvenidos para cualquiera de `los repositorios de ros2 <https:/github.com/ros2>`__. Consulte la página :doc:`Contribuir <The-ROS2-Project/Contributing>` para obtener más detalles y etiqueta sobre cómo contribuir.

source: Discussion
es: Discusión

source: To start a discussion with other ROS 2 community members, visit the official `ROS Discourse <https://discourse.ros.org/>`__. Content on the Discourse should be high-level; it's not a place to get *questions* about code answered, but it would be suitable to start a conversation about best practices or improving standards.
es: Para iniciar una discusión con otros miembros de la comunidad ROS 2, visite el `ROS Discourse oficial <https://discourse.ros.org/>`__. El contenido en el Discurso debe ser de alto nivel; no es un lugar para obtener *preguntas* sobre el código respondidas, pero sería adecuado para iniciar una conversación sobre las mejores prácticas o mejorar los estándares.

source: Discussions about ROS 2 development and plans are happening on the `“Next Generation ROS” Discourse category <https://discourse.ros.org/c/ng-ros>`__. Participating in these discussions is an important way to have a say on how different features of ROS 2 will work and be implemented.
es: Las discusiones sobre el desarrollo y los planes de ROS 2 están ocurriendo en la categoría `“Next Generation ROS” Discourse <https://discourse.ros.org/c/ng-ros>`__. Participar en estas discusiones es una forma importante de tener una opinión sobre cómo funcionarán y se implementarán las diferentes características de ROS 2.

source: The diverse community behind the ROS ecosystem is one of its greatest assets. We encourage all members of the ROS community to participate in these design discussions so that we can leverage the experience of community members, and keep the varied use cases of ROS in mind.
es: La diversa comunidad detrás del ecosistema ROS es uno de sus mayores activos. Alentamos a todos los miembros de la comunidad ROS a participar en estas discusiones de diseño para que podamos aprovechar la experiencia de los miembros de la comunidad y tener en cuenta los diversos casos de uso de ROS.

source: Etiquette
es: Etiqueta

source: Assume 'good faith': It's easy to mis-interpret the meaning or tone of comments on the internet. Assuming good faith gives the benefit of the doubt to those trying to help you, avoiding: insulting well meaning community members, and poisoning the mood. Assuming 'good faith' when responding almost always works better even if the original response was not in fact in good faith.
es: Suponga 'buena fe': es fácil malinterpretar el significado o el tono de los comentarios en Internet. Suponer buena fe da el beneficio de la duda a aquellos que intentan ayudarlo, evitando: insultar a los miembros de la comunidad bien intencionados y envenenar el ambiente. Suponer 'buena fe' al responder casi siempre funciona mejor incluso si la respuesta original no fue de hecho de buena fe.

source: Please don't send your question more than once: The question was seen. If you didn't get a response then likely nobody has had time to answer you. Alternatively, it could be that nobody knows the answer. In any case, sending it again is poor form and akin to shouting and is likely to aggravate a large number of people. This also applies to crossposting. Try to pick the forum which you think matches best and ask there. If you are referred to a new forum, provide a link to the old discussion.
es: Por favor, no envíe su pregunta más de una vez: la pregunta fue vista. Si no recibió una respuesta, es probable que nadie haya tenido tiempo de responderle. Alternativamente, podría ser que nadie conozca la respuesta. En cualquier caso, enviarlo nuevamente es una mala forma y se parece a gritar y es probable que moleste a una gran cantidad de personas. Esto también se aplica a la publicación cruzada. Intente elegir el foro que crea que mejor se adapta y pregunte allí. Si se le remite a un nuevo foro, proporcione un enlace a la antigua discusión.

source: On https://answers.ros.org you can edit your question to provide more details. The more details that you include in your question the easier it is for others to help you find your solution which makes it more likely for you to get a response.
es: En https://answers.ros.org puede editar su pregunta para proporcionar más detalles. Cuantos más detalles incluya en su pregunta, más fácil será que otros lo ayuden a encontrar su solución, lo que hace más probable que reciba una respuesta.

source: It's considered bad form to list your personal deadlines; community members answering questions also have them.
es: Se considera una mala forma enumerar sus plazos personales; los miembros de la comunidad que responden preguntas también los tienen.

source: Do not beg for help. If there is someone willing and able to help with your problem, you usually get a response. Asking for faster answers will mostly have a negative effect.
es: No supliques ayuda. Si hay alguien dispuesto y capaz de ayudarlo con su problema, generalmente obtendrá una respuesta. Pedir respuestas más rápidas tendrá principalmente un efecto negativo.

source: Do not add unrelated content to posts. The content of posts should be focused on the topic at hand and not include unrelated content. Content, links, and images unrelated to the topic are considered spam.
es: No agregue contenido no relacionado a las publicaciones. El contenido de las publicaciones debe centrarse en el tema en cuestión y no incluir contenido no relacionado. El contenido, los enlaces y las imágenes no relacionados con el tema se consideran spam.

source: For commercial posts, see also `this discussion <https://discourse.ros.org/t/sponsorship-notation-in-posts-on-ros-org/2078>`_.
es: Para publicaciones comerciales, consulte también `esta discusión <https://discourse.ros.org/t/sponsorship-notation-in-posts-on-ros-org/2078>`_.

source: Minimize references to content behind pay walls. The content posted on `ROS Discourse <https://discourse.ros.org/>`__ and `ROS Answers <https://answers.ros.org/>`__ should "generally" be free and open to all users. Links to content behind pay walls such as private journal articles, text books, and paid news websites, while helpful and relevant, may not be accessible to all users. Where possible primary sources should be free and open with paid content playing a supporting role.
es: Minimice las referencias al contenido detrás de los muros de pago. El contenido publicado en `ROS Discourse <https://discourse.ros.org/>`__ y `ROS Answers <https://answers.ros.org/>`__ debe ser "generalmente" gratuito y abierto a todos los usuarios. Los enlaces al contenido detrás de los muros de pago, como artículos de revistas privadas, libros de texto y sitios web de noticias pagas, si bien son útiles y relevantes, pueden no ser accesibles para todos los usuarios. Cuando sea posible, las fuentes primarias deben ser gratuitas y abiertas con contenido pago que juegue un papel de apoyo.

source: Single link posts are to be avoided. Generally speaking, posting a single link answer is less helpful and can be easily confused with spam. Moreover, links may degrade over time or be replaced. Paraphrasing a link's content along with some contextual information and attribution is often much more helpful.
es: Se deben evitar las publicaciones de un solo enlace. En general, publicar una respuesta de un solo enlace es menos útil y puede confundirse fácilmente con spam. Además, los enlaces pueden degradarse con el tiempo o ser reemplazados. Parafrasear el contenido de un enlace junto con alguna información contextual y atribución a menudo es mucho más útil.

source: Private contact
es: Contacto privado

source: If you'd like to contact us privately (e.g., if your question contains information sensitive to your organization or project, or if it's regarding a security issue), you can email us directly at ``ros@osrfoundation.org``.
es: Si desea contactarnos en privado (por ejemplo, si su pregunta contiene información confidencial para su organización o proyecto, o si se trata de un problema de seguridad), puede enviarnos un correo electrónico directamente a ``ros@osrfoundation.org``.
