Repository: ros2/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Glossary.po
Languages: es

source: Glossary
es: Glosario

source: Glossary of terms used throughout this documentation:
es: Glosario de términos utilizados en toda esta documentación:

source: An API, or Application Programming Interface, is an interface that is provided by an "application", which in this case is usually a shared library or other language appropriate shared resource. APIs are made up of files that define a contract between the software using the interface and the software providing the interface. These files typically manifest as header files in C and C++ and as Python files in Python. In either case it is important that APIs are grouped and described in documentation and that they are declared as either public or private. Public interfaces are subject to change rules and changes to the public interfaces prompt a new version number of the software that provides them.
es: Una API, o interfaz de programación de aplicaciones, es una interfaz que proporciona una "aplicación", que en este caso suele ser una biblioteca compartida u otro recurso compartido apropiado para el idioma. Las API están compuestas por archivos que definen un contrato entre el software que utiliza la interfaz y el software que proporciona la interfaz. Estos archivos generalmente se manifiestan como archivos de encabezado en C y C++ y como archivos de Python en Python. En cualquier caso, es importante que las API se agrupen y describan en la documentación y que se declaren como públicas o privadas. Las interfaces públicas están sujetas a reglas de cambio y los cambios en las interfaces públicas provocan un nuevo número de versión del software que las proporciona.

source: A client library is an :term:`API` that provides access to the ROS graph using primitive middleware concepts like Topics, Services, and Actions.
es: Una biblioteca de cliente es una :term:`API` que proporciona acceso al gráfico ROS utilizando conceptos de middleware primitivos como Temas, Servicios y Acciones.

source: package
es: paquete

source: A single unit of software, including source code, build system files, documentation, tests, and other associated resources.
es: Una sola unidad de software, que incluye código fuente, archivos del sistema de compilación, documentación, pruebas y otros recursos asociados.

source: ROS Enhancement Proposal. A document that describes an enhancement, standardization, or convention for the ROS community. The associated REP approval process allows the community to iterate on a proposal until some consensus has been made, at which point it can be ratified and implemented, which then becomes documentation. All REPs are viewable from the `REP index <http://www.ros.org/reps/rep-0000.html>`_.
es: Propuesta de mejora de ROS. Un documento que describe una mejora, estandarización o convención para la comunidad ROS. El proceso de aprobación REP asociado permite a la comunidad iterar en una propuesta hasta que se haya llegado a un consenso, momento en el que puede ser ratificada e implementada, que luego se convierte en documentación. Todos los REPs son visibles desde el `índice REP <http://www.ros.org/reps/rep-0000.html>`_.

source: Version Control System, such as CVS, SVN, git, mercurial, etc...
es: Sistema de control de versiones, como CVS, SVN, git, mercurial, etc...

source: The C++ specific :term:`Client Library <client_library>` for ROS. This includes any middleware related APIs as well as the related message generation of C++ data structures based on interface definitions like Messages, Services, and Actions.
es: La :term:`Biblioteca de cliente <client_library>` específica de C++ para ROS. Esto incluye cualquier API relacionada con el middleware, así como la generación de mensajes relacionados de estructuras de datos C++ basadas en definiciones de interfaz como Mensajes, Servicios y Acciones.

source: repository
es: repositorio

source: A collection of packages usually managed using a :term:`VCS` like git or mercurial and usually hosted on a site like GitHub or BitBucket. In the context of this document, repositories usually contain one or more |packages| of one type or another.
es: Una colección de paquetes generalmente administrados utilizando un :term:`VCS` como git o mercurial y generalmente alojados en un sitio como GitHub o BitBucket. En el contexto de este documento, los repositorios generalmente contienen uno o más |packages| de un tipo u otro.
