Repository: ros2/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Installation.po
Languages: es

source: Follow installation instructions at http://brew.sh/
es: Siga las instrucciones de instalación en http://brew.sh/

source: *Optional*: Check that ``brew`` is happy with your system configuration by running:
es: *Opcional*: verifique que ``brew`` esté bien con su configuración del sistema ejecutando:

source: Fix any problems that it identifies.
es: Solucione cualquier problema que identifique.

source: Use ``brew`` to install more stuff:
es: Use ``brew`` para instalar más cosas:

source: Setup some environment variables:
es: Configure algunas variables de entorno:

source: Use ``python3 -m pip`` (just ``pip`` may install Python3 or Python2) to install more stuff:
es: Use ``python3 -m pip`` (solo ``pip`` puede instalar Python3 o Python2) para instalar más cosas:

source: Please ensure that the ``$PATH`` environment variable contains the install location of the binaries (``$(brew --prefix)/bin``)
es: Asegúrese de que la variable de entorno ``$PATH`` contenga la ubicación de instalación de los binarios (``$(brew --prefix)/bin``)

source: *Optional*: if you want to build the ROS 1<->2 bridge, then you must also install ROS 1:
es: *Opcional*: si desea compilar el puente ROS 1 <-> 2, también debe instalar ROS 1:

source: Start with the normal install instructions: http://wiki.ros.org/kinetic/Installation/OSX/Homebrew/Source
es: Comience con las instrucciones de instalación normales: http://wiki.ros.org/kinetic/Installation/OSX/Homebrew/Source

source: When you get to the step where you call ``rosinstall_generator`` to get the source code, here's an alternate invocation that brings in just the minimum required to produce a useful bridge:
es: Cuando llegue al paso en el que llama a ``rosinstall_generator`` para obtener el código fuente, aquí hay una invocación alternativa que trae solo lo mínimo necesario para producir un puente útil:

source: Otherwise, just follow the normal instructions, then source the resulting ``install_isolated/setup.bash`` before proceeding here to build ROS 2.
es: De lo contrario, simplemente siga las instrucciones normales, luego ejecute el resultado ``install_isolated/setup.bash`` antes de continuar aquí para compilar ROS 2.

source: Disable System Integrity Protection (SIP)
es: Deshabilitar la protección de integridad del sistema (SIP)

source: macOS/OS X versions >=10.11 have System Integrity Protection enabled by default. So that SIP doesn't prevent processes from inheriting dynamic linker environment variables, such as ``DYLD_LIBRARY_PATH``, you'll need to disable it `following these instructions <https://developer.apple.com/library/content/documentation/Security/Conceptual/System_Integrity_Protection_Guide/ConfiguringSystemIntegrityProtection/ConfiguringSystemIntegrityProtection.html>`__.
es: Las versiones de macOS / OS X> = 10.11 tienen System Integrity Protection habilitado de forma predeterminada. Para que SIP no impida que los procesos hereden variables de entorno del enlazador dinámico, como ``DYLD_LIBRARY_PATH``, deberá deshabilitarlo `siguiendo estas instrucciones <https://developer.apple.com/library/content/documentation/Security/Conceptual/System_Integrity_Protection_Guide/ConfiguringSystemIntegrityProtection/ConfiguringSystemIntegrityProtection.html>`__.

source: Run the ``colcon`` tool to build everything (more on using ``colcon`` in :doc:`this tutorial <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`):
es: Ejecute la herramienta ``colcon`` para compilar todo (más sobre el uso de ``colcon`` en :doc:`este tutorial <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`):

source: Note: due to an unresolved issue with SIP, Qt@5, and PyQt5, we need to disable ``python_qt_binding`` to have the build succeed. This will be removed when the issue is resolved, see: https://github.com/ros-visualization/python_qt_binding/issues/103
es: Nota: debido a un problema sin resolver con SIP, Qt@5 y PyQt5, debemos deshabilitar ``python_qt_binding`` para que la compilación tenga éxito. Esto se eliminará cuando se resuelva el problema, consulte: https://github.com/ros-visualization/python_qt_binding/issues/103

source: Source the ROS 2 setup file:
es: Ejecute el archivo de configuración de ROS 2:

source: In one terminal, set up the ROS 2 environment as described above and then run a C++ ``talker``:
es: En una terminal, configure el entorno ROS 2 como se describe arriba y luego ejecute un C++ ``talker``:

source: Continue with the `tutorials and demos <../../Tutorials>` to configure your environment, create your own workspace and packages, and learn ROS 2 core concepts.
es: Continúe con los `tutoriales y demos <../../Tutorials>` para configurar su entorno, crear su propio espacio de trabajo y paquetes, y aprender los conceptos básicos de ROS 2.

source: The ROS 1 bridge can connect topics from ROS 1 to ROS 2 and vice-versa. See the dedicated `documentation <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__ on how to build and use the ROS 1 bridge.
es: El puente ROS 1 puede conectar temas de ROS 1 a ROS 2 y viceversa. Consulte la `documentación dedicada <https://github.com/ros2/ros1_bridge/blob/master/README.md>`__ sobre cómo compilar y usar el puente ROS 1.

source: Troubleshooting techniques can be found :ref:`here <macOS-troubleshooting>`.
es: Las técnicas de solución de problemas se pueden encontrar :ref:`aquí <macOS-troubleshooting>`.

source: DDS implementations
es: Implementaciones de DDS

source: By default, ROS 2 uses DDS as its `middleware <https://design.ros2.org/articles/ros_on_dds.html>`__. It is compatible with multiple DDS or RTPS (the DDS wire protocol) vendors. There is currently support for eProsima's Fast DDS, RTI's Connext DDS, Eclipse Cyclone DDS, and GurumNetworks GurumDDS. See https://ros.org/reps/rep-2000.html for supported DDS vendors by distribution.
es: De forma predeterminada, ROS 2 utiliza DDS como su `middleware <https://design.ros2.org/articles/ros_on_dds.html>`__. Es compatible con múltiples proveedores de DDS o RTPS (el protocolo de cable DDS). Actualmente hay soporte para Fast DDS de eProsima, Connext DDS de RTI, Eclipse Cyclone DDS y GurumNetworks GurumDDS. Consulte https://ros.org/reps/rep-2000.html para obtener los proveedores de DDS admitidos por distribución.

source: The default DDS vendor is eProsima's Fast DDS.
es: El proveedor DDS predeterminado es Fast DDS de eProsima.

source: :doc:`Working with Eclipse Cyclone DDS <DDS-Implementations/Working-with-Eclipse-CycloneDDS>` explains how to utilize Cyclone DDS.
es: :doc:`Trabajando con Eclipse Cyclone DDS <DDS-Implementations/Working-with-Eclipse-CycloneDDS>` explica cómo utilizar Cyclone DDS.

source: :doc:`Working with eProsima Fast DDS <DDS-Implementations/Working-with-eProsima-Fast-DDS>` explains how to utilize Fast DDS.
es: :doc:`Trabajando con eProsima Fast DDS <DDS-Implementations/Working-with-eProsima-Fast-DDS>` explica cómo utilizar Fast DDS.

source: :doc:`Working with GurumNetworks GurumDDS <DDS-Implementations/Working-with-GurumNetworks-GurumDDS>` explains how to utilize GurumDDS.
es: :doc:`Trabajando con GurumNetworks GurumDDS <DDS-Implementations/Working-with-GurumNetworks-GurumDDS>` explica cómo utilizar GurumDDS.

source: If you would like to use one of the other vendors you will need to install their software separately before building. The ROS 2 build will automatically build support for vendors that have been installed and sourced correctly.
es: Si desea utilizar uno de los otros proveedores, deberá instalar su software por separado antes de compilar. La compilación de ROS 2 compilará automáticamente el soporte para los proveedores que se hayan instalado y configurado correctamente.

source: Once you've installed a new DDS vendor, you can change the vendor used at runtime: :doc:`Working with Multiple RMW Implementations <../How-To-Guides/Working-with-multiple-RMW-implementations>`.
es: Una vez que haya instalado un nuevo proveedor de DDS, puede cambiar el proveedor utilizado en tiempo de ejecución: :doc:`Trabajar con múltiples implementaciones de RMW <../How-To-Guides/Working-with-multiple-RMW-implementations>`.

source: Detailed instructions for installing other DDS vendors are provided below.
es: A continuación se proporcionan instrucciones detalladas para instalar otros proveedores de DDS.

source: Platforms / Installation types
es: Plataformas / Tipos de instalación

source: Ubuntu Linux source install
es: Instalación desde la fuente en Ubuntu Linux

source: RTI Connext (version 6.0.1, amd64 only)
es: RTI Connext (versión 6.0.1, solo amd64)

source: Debian packages provided in the ROS 2 apt repositories
es: Paquetes Debian proporcionados en los repositorios apt de ROS 2

source: You can install a Debian package of RTI Connext available on the ROS 2 apt repositories. You will need to accept a license from RTI.
es: Puede instalar un paquete Debian de RTI Connext disponible en los repositorios apt de ROS 2. Deberá aceptar una licencia de RTI.

source: Source the setup file to set the ``NDDSHOME`` environment variable.
es: Ejecute el archivo de configuración para establecer la variable de entorno ``NDDSHOME``.

source: Note: when using ``zsh`` you need to be in the directory of the script when sourcing it to have it work properly
es: Nota: cuando usa ``zsh``, debe estar en el directorio del script cuando lo ejecute para que funcione correctamente

source: Now you can build as normal and support for RTI will be built as well.
es: Ahora puede compilar normalmente y también se compilará el soporte para RTI.

source: Official binary packages from RTI
es: Paquetes binarios oficiales de RTI

source: You can install the Connext 6.0.1 package for Linux provided by RTI, via options available for :doc:`university, purchase or evaluation <DDS-Implementations/Install-Connext-University-Eval>`
es: Puede instalar el paquete Connext 6.0.1 para Linux proporcionado por RTI, a través de las opciones disponibles para :doc:`universidad, compra o evaluación <DDS-Implementations/Install-Connext-University-Eval>`

source: After downloading, use ``chmod +x`` on the ``.run`` executable and then execute it. Note that if you're installing to a system directory use ``sudo`` as well.
es: Después de descargar, use ``chmod +x`` en el ejecutable ``.run`` y luego ejecútelo. Tenga en cuenta que si está instalando en un directorio del sistema, también use ``sudo``.

source: The default location is ``~/rti_connext_dds-6.0.1``
es: La ubicación predeterminada es ``~/rti_connext_dds-6.0.1``

source: After installation, run RTI launcher and point it to your license file (obtained from RTI).
es: Después de la instalación, ejecute el iniciador de RTI y apúntelo a su archivo de licencia (obtenido de RTI).

source: Add the following line to your ``.bashrc`` file pointing to your copy of the license.
es: Agregue la siguiente línea a su archivo ``.bashrc`` que apunta a su copia de la licencia.

source: Ubuntu Linux binary install
es: Instalación binaria de Ubuntu Linux

source: To use RTI Connext DDS there are full-suite install options available for :doc:`university, purchase or evaluation <DDS-Implementations/Install-Connext-University-Eval>` or you can install a libraries-only Debian package of RTI Connext 6.0.1, available from the OSRF Apt repository under a `non-commercial license <https://www.rti.com/ncl>`__.
es: Para usar RTI Connext DDS, hay opciones de instalación de paquetes completos disponibles para :doc:`universidad, compra o evaluación <DDS-Implementations/Install-Connext-University-Eval>` o puede instalar un paquete Debian solo de bibliotecas de RTI Connext 6.0.1, disponible en el repositorio OSRF Apt bajo una `licencia no comercial <https://www.rti.com/ncl>`__.

source: To install the libs-only Debian package:
es: Para instalar el paquete Debian solo de bibliotecas:

source: You will need to accept a license agreement from RTI, and will find an 'rti_license.dat file in the installation.
es: Deberá aceptar un acuerdo de licencia de RTI y encontrará un archivo 'rti_license.dat en la instalación.

source: Add the following line to your ``.bashrc`` file pointing to your copy of the license (and source it).
es: Agregue la siguiente línea a su archivo ``.bashrc`` que apunta a su copia de la licencia (y ejecútelo).

source: All options need you to source the setup file to set the ``NDDSHOME`` environment variable:
es: Todas las opciones necesitan que ejecute el archivo de configuración para establecer la variable de entorno ``NDDSHOME``:

source: Note: the above may need modification to match your RTI installation location
es: Nota: lo anterior puede necesitar modificaciones para que coincida con la ubicación de su instalación de RTI

source: If you want to install the Connext DDS-Security plugins please refer to :doc:`this page <DDS-Implementations/Install-Connext-Security-Plugins>`.
es: Si desea instalar los complementos de seguridad de Connext DDS, consulte :doc:`esta página <DDS-Implementations/Install-Connext-Security-Plugins>`.

source: OSX source install
es: Instalación desde código fuente en OSX

source: If you would like to also build against RTI Connext DDS there are options available for :doc:`university, purchase or evaluation <DDS-Implementations/Install-Connext-University-Eval>`
es: Si también desea compilar contra RTI Connext DDS, hay opciones disponibles para :doc:`universidad, compra o evaluación <DDS-Implementations/Install-Connext-University-Eval>`

source: You also need a Java runtime installed to run the RTI code generator, which you can get `here <https://support.apple.com/kb/DL1572?locale=en_US>`__.
es: También necesita un tiempo de ejecución de Java instalado para ejecutar el generador de código RTI, que puede obtener `aquí <https://support.apple.com/kb/DL1572?locale=en_US>`__.

source: After installing, run RTI launcher and point it to your license file.
es: Después de la instalación, ejecute el iniciador de RTI y apúntelo a su archivo de licencia.

source: Source the setup file to set the ``NDDSHOME`` environment variable before building your workspace.
es: Ejecute el archivo de configuración para establecer la variable de entorno ``NDDSHOME`` antes de compilar su espacio de trabajo.

source: You may need to increase shared memory resources following https://community.rti.com/kb/osx510
es: Es posible que deba aumentar los recursos de memoria compartida siguiendo https://community.rti.com/kb/osx510

source: OSX binary install
es: Instalación binaria en OSX

source: Enable Connext support
es: Habilitar el soporte de Connext

source: To use RTI Connext DDS there are options available for :doc:`university, purchase or evaluation <DDS-Implementations/Install-Connext-University-Eval>`
es: Para usar RTI Connext DDS, hay opciones disponibles para :doc:`universidad, compra o evaluación <DDS-Implementations/Install-Connext-University-Eval>`

source: You may need to increase shared memory resources following https://community.rti.com/kb/osx510.
es: Es posible que deba aumentar los recursos de memoria compartida siguiendo https://community.rti.com/kb/osx510.

source: Windows source install
es: Instalación desde código fuente en Windows

source: After installing, use the RTI Launcher to load your license file.
es: Después de la instalación, use el iniciador de RTI para cargar su archivo de licencia.

source: Then before building ROS 2, set up the Connext environment:
es: Luego, antes de compilar ROS 2, configure el entorno Connext:

source: Note that this path might need to be slightly altered depending on where you selected to install RTI Connext DDS, and which version of Visual Studio was selected. The path above is the current default path as of version 6.0.1, but will change as the version numbers increment in the future.
es: Tenga en cuenta que esta ruta podría necesitar modificaciones ligeramente según el lugar donde seleccionó instalar RTI Connext DDS y qué versión de Visual Studio se seleccionó. La ruta anterior es la ruta predeterminada actual a partir de la versión 6.0.1, pero cambiará a medida que los números de versión aumenten en el futuro.

source: Windows binary install
es: Instalación binaria en Windows

source: Then before using ROS 2, set up the Connext environment:
es: Luego, antes de usar ROS 2, configure el entorno Connext:

source: Connext security plugins
es: Complementos de seguridad de Connext

source: The Connext DDS Libraries are included with ROS 2 under a `non-commercial license <https://www.rti.com/ncl>`__ and do not include the security plug-in libraries. These libraries are available in the commercial, university and research license versions of RTI Connext DDS Pro, which is bundled with tools for system debugging, monitoring, record/replay, etc.
es: Las bibliotecas Connext DDS están incluidas en ROS 2 bajo una `licencia no comercial <https://www.rti.com/ncl>`__ y no incluyen las bibliotecas de complementos de seguridad. Estas bibliotecas están disponibles en las versiones de licencia comercial, universitaria e investigativa de RTI Connext DDS Pro, que se incluye con herramientas para la depuración del sistema, monitoreo, grabación/reproducción, etc.

source: The Connext DDS Evaluation Version (6.0.1) includes the security plugins, and can be downloaded via options available for :doc:`university, purchase or evaluation <Install-Connext-University-Eval>`.
es: La versión de evaluación de Connext DDS (6.0.1) incluye los complementos de seguridad y se puede descargar a través de las opciones disponibles para :doc:`universidad, compra o evaluación <Install-Connext-University-Eval>`.

source: A video walk-thru of this installation (tools and security plug-ins) is available `here <https://www.rti.com/gettingstarted/installwindows_secure>`__ at the RTI website. The steps are:
es: Una guía en video de esta instalación (herramientas y complementos de seguridad) está disponible `aquí <https://www.rti.com/gettingstarted/installwindows_secure>`__ en el sitio web de RTI. Los pasos son:

source: **Install Connext DDS Pro (Host)** This is a host-specific installer application (for Windows, Linux, MacOS) to install a 'Host' bundle which includes the Launcher, tools, and other software services. At the end of the installation, the RTI 'Launcher' program will be started. The Launcher is used to install target libraries, security plugins, and other layered services.
es: **Instalar Connext DDS Pro (Host)** Esta es una aplicación de instalador específica del host (para Windows, Linux, MacOS) para instalar un paquete 'Host' que incluye el iniciador, herramientas y otros servicios de software. Al final de la instalación, se iniciará el programa RTI 'Launcher'. El iniciador se utiliza para instalar bibliotecas de destino, complementos de seguridad y otros servicios de capa.

source: **Use the Package Installer in Launcher**
es: **Usar el instalador de paquetes en el iniciador**

source: Launcher Image
es: Imagen del iniciador

source: The 'RTI Package Installer' is used to install '.rtipkg' files -- target libraries, security plug-ins, etc. Open the Package Installer and select all of the .rtipkg files that were included in the Connext DDS Secure bundle for installation:
es: El 'Instalador de paquetes RTI' se utiliza para instalar archivos '.rtipkg' - bibliotecas de destino, complementos de seguridad, etc. Abra el Instalador de paquetes y seleccione todos los archivos .rtipkg que se incluyeron en el paquete Connext DDS Secure para la instalación:

source: Target Libraries - such as: rti\_connext\_dds-[version]-pro-target-[toolchain].rtipkg
es: Bibliotecas de destino - como: rti\_connext\_dds-[version]-pro-target-[toolchain].rtipkg

source: Security Plugin Host - such as: rti\_security\_plugins-[version]-host-[toolchain].rtipkg
es: Host de complemento de seguridad - como: rti\_security\_plugins-[version]-host-[toolchain].rtipkg

source: Security Plugin Target - such as: rti\_security\_plugins-[version]-target-[toolchain].rtipkg
es: Destino del complemento de seguridad - como: rti\_security\_plugins-[version]-target-[toolchain].rtipkg

source: OpenSSL Host - such as: openssl-1.0.2x-[version]-host-[toolchain].rtipkg
es: Host de OpenSSL - como: openssl-1.0.2x-[version]-host-[toolchain].rtipkg

source: **Extract and Install OpenSSL** This is included as an archive (.zip or otherwise) and can be simply extracted and copied to a convenient location on your host computer. As a suggestion, this could also be installed into the 'rti\_connext\_dds-[version]' directory in your home directory space (this was created during installation of the RTI host tools). Note: this directory location may need to be placed in your PATH environment variable. See the `RTI Security Plugins Getting Started Guide <https://community.rti.com/static/documentation/connext-dds/6.0.1/doc/manuals/connext_dds/dds_security/RTI_SecurityPlugins_GettingStarted.pdf>`__ for more information.
es: **Extraer e instalar OpenSSL** Esto se incluye como un archivo (.zip u otro) y se puede extraer y copiar simplemente en una ubicación conveniente en su computadora host. Como sugerencia, esto también se podría instalar en el directorio 'rti\_connext\_dds-[version]' en el espacio de su directorio principal (esto se creó durante la instalación de las herramientas de host de RTI). Nota: es posible que esta ubicación del directorio deba colocarse en su variable de entorno PATH. Consulte la `Guía de inicio de los complementos de seguridad de RTI <https://community.rti.com/static/documentation/connext-dds/6.0.1/doc/manuals/connext_dds/dds_security/RTI_SecurityPlugins_GettingStarted.pdf>`__ para obtener más información.

source: Installation complete.
es: Instalación completa.

source: A libraries-only version of RTI Connext DDS 6.0.1 may be installed per the :doc:`installation instructions <../../Installation>` for Debian/Ubuntu Linux (amd64) platforms only, under a `non-commercial license <https://www.rti.com/ncl>`__.
es: Una versión solo de bibliotecas de RTI Connext DDS 6.0.1 se puede instalar según las :doc:`instrucciones de instalación <../../Installation>` para plataformas Debian/Ubuntu Linux (amd64) solamente, bajo una `licencia no comercial <https://www.rti.com/ncl>`__.

source: A full-suite installation of RTI Connext DDS is available for many additional platforms, for universities, evaluation, or purchase. This installation includes diagnostic tools, layered services, and security. See below for installation details.
es: Una instalación de paquete completo de RTI Connext DDS está disponible para muchas plataformas adicionales, para universidades, evaluación o compra. Esta instalación incluye herramientas de diagnóstico, servicios de capa y seguridad. Consulte a continuación los detalles de la instalación.

source: RTI University Program
es: Programa universitario de RTI

source: University researchers and classroom users may be eligible for a free academic license through the `RTI University Program <https://www.rti.com/free-trial/university-program>`__. This includes a one-year (renewable) license to the unabridged version of Connext DDS Secure, which includes diagnostic tools and layered services. The university license application can be found `here <https://www.rti.com/free-trial/university-program>`__.
es: Los investigadores universitarios y los usuarios de aula pueden ser elegibles para una licencia académica gratuita a través del `Programa Universitario de RTI <https://www.rti.com/free-trial/university-program>`__. Esto incluye una licencia de un año (renovable) a la versión íntegra de Connext DDS Secure, que incluye herramientas de diagnóstico y servicios de capa. La solicitud de licencia universitaria se puede encontrar `aquí <https://www.rti.com/free-trial/university-program>`__.

source: RTI Connext DDS Evaluation
es: Evaluación de RTI Connext DDS
