Repository: ros2/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Installation.po
Languages: es

source: This page explains how to install ROS 2 on Windows from a pre-built binary package.
es: Esta página explica cómo instalar ROS 2 en Windows desde un paquete binario precompilado.

source: Binary releases of {DISTRO_TITLE_FULL} are not provided. Instead you may download nightly :ref:`prerelease binaries <Prerelease_binaries>`.
es: No se proporcionan versiones binarias de {DISTRO_TITLE_FULL}. En su lugar, puede descargar :ref:`binarios previos al lanzamiento <Prerelease_binaries>` diarios.

source: Download the latest package for Windows, e.g., ``ros2-package-windows-AMD64.zip``.
es: Descargue el último paquete para Windows, por ejemplo, ``ros2-package-windows-AMD64.zip``.

source: There may be more than one binary download option which might cause the file name to differ.
es: Puede haber más de una opción de descarga binaria que podría hacer que el nombre del archivo sea diferente.

source: To install debug libraries for ROS 2, see `Extra Stuff for Debug`_. Then continue on with downloading ``ros2-package-windows-debug-AMD64.zip``.
es: Para instalar bibliotecas de depuración para ROS 2, consulte `Cosas extra para depuracion`_. Luego continúe con la descarga de ``ros2-package-windows-debug-AMD64.zip``.

source: Unpack the zip file somewhere (we'll assume ``C:\dev\ros2_{DISTRO}``\ ).
es: Desempaquete el archivo zip en algún lugar (asumiremos ``C:\dev\ros2_{DISTRO}``\ ).

source: In a command shell, set up the ROS 2 environment as described above and then run a C++ ``talker``\ :
es: En un shell de comandos, configure el entorno ROS 2 como se describe arriba y luego ejecute un ``talker``\ de C++:

source: Start another command shell and run a Python ``listener``\ :
es: Inicie otro shell de comandos y ejecute un ``listener``\ de Python:

source: Extra Stuff for Debug
es: Cosas extra para depuracion

source: To download the ROS 2 debug libraries you'll need to download ``ros2-{DISTRO}-*-windows-debug-AMD64.zip``. Please note that debug libraries require some more additional configuration/setup to work as given below.
es: Para descargar las bibliotecas de depuración de ROS 2, necesitará descargar ``ros2-{DISTRO}-*-windows-debug-AMD64.zip``. Tenga en cuenta que las bibliotecas de depuración requieren una configuración adicional para funcionar como se indica a continuación.

source: Python installation may require modification to enable debugging symbols and debug binaries:
es: La instalación de Python puede requerir modificación para habilitar los símbolos de depuración y los binarios de depuración:

source: Search in windows **Search Bar** and open **Apps and Features**.
es: Busque en la **Barra de Búsqueda** de Windows y abra **Aplicaciones y Características**.

source: Search for the installed Python version.
es: Busque la versión de Python instalada.

source: Click Modify.
es: Haga click en Modificar.

source: Click Next to go to **Advanced Options**.
es: Haga click en Siguiente para ir a **Opciones Avanzadas**.

source: Make sure **Download debugging symbols** and **Download debug binaries** are checked.
es: Compruebe que **Descargar símbolos de depuración** y **Descargar binarios de depuración** están marcados.

source: Click Install.
es: Haga click en Instalar.

source: (Alternative) ROS 2 Build Installation from aka.ms/ros
es: (Alternativa) Instalación de compilación de ROS 2 desde aka.ms/ros

source: https://aka.ms/ros project hosts ROS 2 builds against the release snapshots. This section explains how to install ROS 2 from this channel.
es: https://aka.ms/ros el proyecto aloja compilaciones de ROS 2 contra las versiones preliminares de lanzamiento. Esta sección explica cómo instalar ROS 2 desde este canal.

source: Install ROS 2 builds
es: Instalar compilaciones de ROS 2

source: In an administrative command prompt, run the following commands.
es: En un símbolo del sistema administrativo, ejecute los siguientes comandos.

source: Start an administrative command prompt and source the ROS 2 setup file to set up the workspace:
es: Comience un símbolo del sistema administrativo y fuente el archivo de configuración de ROS 2 para configurar el espacio de trabajo:

source: Stay up-to-date
es: Mantenerse actualizado

source: To keep up-to-date with the latest builds, run:
es: Para mantenerse actualizado con las últimas compilaciones, ejecute:

source: If you want to completely remove the environment downloaded above, run this command:
es: Se quiere eliminar completamente el entorno descargado anteriormente, ejecute este comando:
