Repository: ros2/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Installation.po
Languages: es

source: To install RTI Connext DDS **version 6.0.1** Evalution:
es: Para instalar RTI Connext DDS **versión 6.0.1** Evalution:

source: Visit the `RTI Free Trial (6.0.1) site <https://www.rti.com/free-trial>`__.
es: Visite el `sitio de prueba gratuita de RTI (6.0.1) <https://www.rti.com/free-trial>`__.

source: Download the version(s) to match your environment.
es: Descargue la(s) versión(es) para que coincida con su entorno.

source: Contact license@rti.com for an evaluation license.
es: Póngase en contacto con license@rti.com para obtener una licencia de evaluación.

source: Install RTI Connext 6.0.1 by running the installation program. When finished, it will run the RTI Launcher.
es: Instale RTI Connext 6.0.1 ejecutando el programa de instalación. Cuando termine, ejecutará el iniciador de RTI.

source: Use the RTI Launcher to install the license file (rti_license.dat) if needed. The launcher may also be used to launch the diagnostic tools and services.
es: Utilice el iniciador de RTI para instalar el archivo de licencia (rti_license.dat) si es necesario. El iniciador también se puede utilizar para iniciar las herramientas de diagnóstico y los servicios.

source: Eclipse Cyclone DDS is a very performant and robust open-source DDS implementation. Cyclone DDS is developed completely in the open as an Eclipse IoT project. See also: https://projects.eclipse.org/projects/iot.cyclonedds
es: Eclipse Cyclone DDS es una implementación DDS de código abierto muy eficiente y robusta. Cyclone DDS se desarrolla completamente en abierto como un proyecto Eclipse IoT. Ver también: https://projects.eclipse.org/projects/iot.cyclonedds

source: Prerequisites
es: Prerrequisitos

source: Have `rosdep installed <https://wiki.ros.org/rosdep#Installing_rosdep>`__
es: Tener `rosdep instalado <https://wiki.ros.org/rosdep#Installing_rosdep>`__

source: Install packages
es: Instalar paquetes

source: The easiest way is to install from ROS 2 apt repository.
es: La forma más fácil es instalar desde el repositorio apt de ROS 2.

source: Build from source code
es: Compilar desde el código fuente

source: Building from source code is also another way to install.
es: Compilar desde el código fuente es otra forma de instalar.

source: First, clone Cyclone DDS and rmw_cyclonedds in the ROS 2 workspace source directory.
es: Primero, clone Cyclone DDS y rmw_cyclonedds en el directorio de origen del espacio de trabajo de ROS 2.

source: Then, install necessary packages for Cyclone DDS.
es: Luego, instale los paquetes necesarios para Cyclone DDS.

source: Finally, run colcon build.
es: Finalmente, ejecute colcon build.

source: Switch to rmw_cyclonedds
es: Cambiar a rmw_cyclonedds

source: Switch from other rmw to rmw_cyclonedds by specifying the environment variable.
es: Cambie de otro rmw a rmw_cyclonedds especificando la variable de entorno.

source: See also: :doc:`Working with multiple RMW implementations <../../How-To-Guides/Working-with-multiple-RMW-implementations>`
es: Ver también: :doc:`Trabajar con múltiples implementaciones de RMW <../../How-To-Guides/Working-with-multiple-RMW-implementations>`

source: Run the talker and listener
es: Ejecute el talker y el listener

source: Now run ``talker`` and ``listener`` to test Cyclone DDS.
es: Ahora ejecute ``talker`` y ``listener`` para probar Cyclone DDS.

source: rmw_gurumdds is a implementation of the ROS middleware interface using GurumNetworks GurumDDS. More information about GurumDDS is available on our website: https://gurum.cc/index_eng
es: rmw_gurumdds es una implementación de la interfaz de middleware ROS que utiliza GurumNetworks GurumDDS. Más información sobre GurumDDS está disponible en nuestro sitio web: https://gurum.cc/index_eng

source: The following description assumes that you have completed the 'Environment setup' process from the :doc:`Installing ROS 2 via Debian Packages <../Ubuntu-Install-Debians>` or from the :doc:`Building ROS 2 on Ubuntu Linux <../Alternatives/Ubuntu-Development-Setup>`.
es: La siguiente descripción asume que ha completado el proceso de 'Configuración del entorno' de :doc:`Instalación de ROS 2 a través de paquetes Debian <../Ubuntu-Install-Debians>` o de :doc:`Construcción de ROS 2 en Ubuntu Linux <../Alternatives/Ubuntu-Development-Setup>`.

source: rmw_gurumdds requires version of GurumDDS-2.8.x. Debian packages of GurumDDS are provided in the ROS 2 apt repositories on ubuntu. Windows binary installer of GurumDDS will be supported soon.
es: rmw_gurumdds requiere la versión de GurumDDS-2.8.x. Los paquetes Debian de GurumDDS se proporcionan en los repositorios apt de ROS 2 en ubuntu. El instalador binario de Windows de GurumDDS se admitirá pronto.

source: GurumDDS requires a license. See the next page: https://gurum.cc/free_trial_eng.html
es: GurumDDS requiere una licencia. Ver la siguiente página: https://gurum.cc/free_trial_eng.html

source: After requesting a trial license, please download the license from the license homepage. After getting a license, move it to the following location.
es: Después de solicitar una licencia de prueba, descargue la licencia desde la página de inicio de la licencia. Después de obtener una licencia, muévala a la siguiente ubicación.

source: DDS Version
es: Versión DDS

source: License Location
es: Ubicación de la licencia

source: The easiest way is to install from ROS 2 apt repository. When ros-{DISTRO}-rmw-gurumdds-cpp is installed, gurumdds-2.8 is also installed.
es: La forma más fácil es instalar desde el repositorio apt de ROS 2. Cuando se instala ros-{DISTRO}-rmw-gurumdds-cpp, también se instala gurumdds-2.8.

source: First, clone rmw_gurumdds in the ROS 2 workspace source directory.
es: Primero, clone rmw_gurumdds en el directorio de origen del espacio de trabajo de ROS 2.

source: Then, install necessary packages for GurumDDS.
es: Luego, instale los paquetes necesarios para GurumDDS.

source: Switch to rmw_gurumdds
es: Cambiar a rmw_gurumdds

source: Switch from other rmw to rmw_gurumdds by specifying the environment variable.
es: Cambie de otro rmw a rmw_gurumdds especificando la variable de entorno.

source: Now run ``talker`` and ``listener`` to test GurumDDS. Don't forget to set up environment by setup script.
es: Ahora ejecute ``talker`` y ``listener`` para probar GurumDDS. No olvide configurar el entorno mediante el script de configuración.

source: eProsima Fast DDS is a complete open-source DDS implementation for real time embedded architectures and operating systems. See also: https://www.eprosima.com/index.php/products-all/eprosima-fast-dds
es: eProsima Fast DDS es una implementación DDS de código abierto completa para arquitecturas y sistemas operativos integrados en tiempo real. Ver también: https://www.eprosima.com/index.php/products-all/eprosima-fast-dds

source: First, clone Fast DDS and rmw_fastrtps in the ROS 2 workspace source directory.
es: Primero, clone Fast DDS y rmw_fastrtps en el directorio de origen del espacio de trabajo de ROS 2.

source: Then, install necessary packages for Fast DDS.
es: Luego, instale los paquetes necesarios para Fast DDS.

source: Switch to rmw_fastrtps
es: Cambiar a rmw_fastrtps

source: The eProsima Fast DDS RMW can be selected by specifying the environment variable:
es: El RMW eProsima Fast DDS se puede seleccionar especificando la variable de entorno:

source: Now run ``talker`` and ``listener`` to test Fast DDS.
es: Ahora ejecute ``talker`` y ``listener`` para probar Fast DDS.

source: Maintain source checkout
es: Mantener la comprobación de origen

source: If you have installed ROS 2 from source, there may have been changes made to the source code since the time that you checked it out. To keep your source checkout up to date, you will have to periodically update your ``ros2.repos`` file, download the latest sources, and rebuild your workspace.
es: Si ha instalado ROS 2 desde el código fuente, puede haber cambios realizados en el código fuente desde el momento en que lo comprobó. Para mantener su comprobación de origen actualizada, deberá actualizar periódicamente su archivo ``ros2.repos``, descargar las últimas fuentes y reconstruir su espacio de trabajo.

source: Update your repository list
es: Actualice su lista de repositorios

source: Each ROS 2 release includes a ``ros2.repos`` file that contains the list of repositories and their version for that release.
es: Cada versión de ROS 2 incluye un archivo ``ros2.repos`` que contiene la lista de repositorios y su versión para esa versión.

source: Latest ROS 2 {DISTRO_TITLE} branches
es: Últimas ramas de ROS 2 {DISTRO_TITLE}

source: If you wish to checkout the latest code for ROS 2 {DISTRO_TITLE}, you can get the relevant repository list by running:
es: Si desea comprobar el código más reciente de ROS 2 {DISTRO_TITLE}, puede obtener la lista de repositorios relevantes ejecutando:

source: Update your repositories
es: Actualice sus repositorios

source: You will notice that in the `ros2.repos <https://raw.githubusercontent.com/ros2/ros2/{REPOS_FILE_BRANCH}/ros2.repos>`__ file, each repository has a ``version`` associated with it that points to a particular commit hash, tag, or branch name. It is possible that these versions refer to new tags/branches that your local copy of the repositories will not recognize as they are out-of-date. Because of this, you should update the repositories that you have already checked out with the following command:
es: Notará que en el archivo `ros2.repos <https://raw.githubusercontent.com/ros2/ros2/{REPOS_FILE_BRANCH}/ros2.repos>`__, cada repositorio tiene una ``versión`` asociada que apunta a un hash de confirmación, etiqueta o nombre de rama en particular. Es posible que estas versiones se refieran a nuevas etiquetas/ramas que su copia local de los repositorios no reconocerá ya que están desactualizadas. Debido a esto, debe actualizar los repositorios que ya ha comprobado con el siguiente comando:

source: Download the new source code
es: Descargue el nuevo código fuente

source: You should now be able to download the sources associated with the new repository list with:
es: Ahora debería poder descargar las fuentes asociadas con la nueva lista de repositorios con:

source: Rebuild your workspace
es: Reconstruya su espacio de trabajo

source: Now that the workspace is up to date with the latest sources, remove your previous install and rebuild your workspace with, for example:
es: Ahora que el espacio de trabajo está actualizado con las últimas fuentes, elimine su instalación anterior y reconstruya su espacio de trabajo con, por ejemplo:

source: Inspect your source checkout
es: Inspeccione su comprobación de origen

source: During your development you may have deviated from the original state of your workspace from when you imported the repository list. If you wish to know the versions of the set of repositories in your workspace, you can export the information using the following command:
es: Durante su desarrollo, es posible que se haya desviado del estado original de su espacio de trabajo desde que importó la lista de repositorios. Si desea conocer las versiones del conjunto de repositorios en su espacio de trabajo, puede exportar la información utilizando el siguiente comando:

source: This ``my_ros2.repos`` file can then be shared with others so that they can reproduce the state of the repositories in your workspace.
es: Este archivo ``my_ros2.repos`` se puede compartir con otros para que puedan reproducir el estado de los repositorios en su espacio de trabajo.

source: RHEL (RPM packages)
es: RHEL (paquetes RPM)

source: RPM packages for ROS 2 {DISTRO_TITLE_FULL} are currently available for RHEL 9. The Rolling Ridley distribution will change target platforms from time to time as new platforms are selected for development. The target platforms are defined in `REP 2000 <https://github.com/ros-infrastructure/rep/blob/master/rep-2000.rst>`__ Most people will want to use a stable ROS distribution.
es: Los paquetes RPM para ROS 2 {DISTRO_TITLE_FULL} están disponibles actualmente para RHEL 9. La distribución Rolling Ridley cambiará las plataformas objetivo de vez en cuando a medida que se seleccionen nuevas plataformas para el desarrollo. Las plataformas objetivo se definen en `REP 2000 <https://github.com/ros-infrastructure/rep/blob/master/rep-2000.rst>`__ La mayoría de las personas querrán usar una distribución ROS estable.

source: Resources
es: Recursos

source: Status Page:
es: Página de estado:

source: `Jenkins Instance <http://build.ros2.org/>`__
es: `Instancia de Jenkins <http://build.ros2.org/>`__

source: `Repositories <http://repo.ros2.org>`__
es: `Repositorios <http://repo.ros2.org>`__

source: You will need to enable the EPEL repositories and the PowerTools repository:
es: Deberá habilitar los repositorios EPEL y el repositorio PowerTools:

source: Next, download the ROS 2 .repo file:
es: A continuación, descargue el archivo .repo de ROS 2:

source: Then, update your metadata cache. DNF may prompt you to verify the GPG key, which should match the location ``https://raw.githubusercontent.com/ros/rosdistro/master/ros.asc``.
es: Luego, actualice su caché de metadatos. DNF puede solicitarle que verifique la clave GPG, que debe coincidir con la ubicación ``https://raw.githubusercontent.com/ros/rosdistro/master/ros.asc``.

source: Desktop Install (Recommended): ROS, RViz, demos, tutorials.
es: Instalación de escritorio (recomendado): ROS, RViz, demos, tutoriales.

source: ROS-Base Install (Bare Bones): Communication libraries, message packages, command line tools. No GUI tools.
es: Instalación de ROS-Base (Bare Bones): bibliotecas de comunicación, paquetes de mensajes, herramientas de línea de comandos. Sin herramientas GUI.

source: The default middleware that ROS 2 uses is ``Fast DDS``, but the middleware (RMW) can be replaced at runtime. See the :doc:`guide <../How-To-Guides/Working-with-multiple-RMW-implementations>` on how to work with multiple RMWs.
es: El middleware predeterminado que usa ROS 2 es ``Fast DDS``, pero el middleware (RMW) se puede reemplazar en tiempo de ejecución. Consulte la :doc:`guía <../How-To-Guides/Working-with-multiple-RMW-implementations>` sobre cómo trabajar con múltiples RMW.

source: If you installed ``ros-{DISTRO}-desktop`` above you can try some examples.
es: Si instaló ``ros-{DISTRO}-desktop`` anteriormente, puede probar algunos

source: Troubleshooting techniques can be found :doc:`here <../How-To-Guides/Installation-Troubleshooting>`.
es: Las técnicas de solución de problemas se pueden encontrar :doc:`aquí <../How-To-Guides/Installation-Troubleshooting>`.

source: If you need to uninstall ROS 2 or switch to a source-based install once you have already installed from binaries, run the following command:
es: Si necesita desinstalar ROS 2 o cambiar a una instalación basada en origen una vez que ya haya instalado desde binarios, ejecute el siguiente comando:

source: Testing with pre-release binaries
es: Pruebas con binarios previos al lanzamiento

source: Many ROS packages are provided as pre-built binaries. Usually, you will get the released version of binaries when following :doc:`../Installation`. There are also pre-released versions of binaries that are useful for testing before making an official release. This article describes several options if you would like to try out pre-released versions of ROS binaries.
es: Muchos paquetes ROS se proporcionan como binarios precompilados. Por lo general, obtendrá la versión publicada de binarios al seguir :doc:`../Installation`. También hay versiones previas al lanzamiento de binarios que son útiles para las pruebas antes de realizar un lanzamiento oficial. Este artículo describe varias opciones si desea probar versiones previas al lanzamiento de binarios ROS.

source: Debian testing repository
es: Repositorio de pruebas de Debian

source: When packages are released into a ROS distribution (using bloom), the buildfarm builds them into debian packages which are stored temporarily in the **building** apt repository. As dependent packages are rebuilt, an automatic process periodically synchronizes the packages in **building** to a secondary repository called **ros-testing**. **ros-testing** is intended as a soaking area where developers and bleeding-edge users may give the packages extra testing, before they are manually synced into the public ros repository from which users typically install packages.
es: Cuando los paquetes se lanzan en una distribución ROS (usando bloom), el buildfarm los compila en paquetes debian que se almacenan temporalmente en el repositorio apt **building**. A medida que se reconstruyen los paquetes dependientes, un proceso automático sincroniza periódicamente los paquetes en **building** con un repositorio secundario llamado **ros-testing**. **ros-testing** está destinado como un área de remojo donde los desarrolladores y los usuarios de vanguardia pueden dar a los paquetes pruebas adicionales, antes de que se sincronicen manualmente en el repositorio público de ros desde el que los usuarios suelen instalar paquetes.

source: Approximately every two weeks, the rosdistro's release manager manually synchronizes the contents of **ros-testing** into the **main** ROS repository.
es: Aproximadamente cada dos semanas, el administrador de lanzamiento de rosdistro sincroniza manualmente el contenido de **ros-testing** en el repositorio ROS **principal**.

source: For Debian-based operating systems, you can install binary packages from the **ros-testing** repository.
es: Para sistemas operativos basados en Debian, puede instalar paquetes binarios desde el repositorio **ros-testing**.

source: Make sure you have a working ROS 2 installation from Debian packages (see :doc:`../Installation`).
es: Asegúrese de tener una instalación de ROS 2 funcional a partir de paquetes Debian (consulte :doc:`../Installation`).

source: Edit (with sudo) the file ``/etc/apt/sources.list.d/ros2.list`` and change ``ros2`` with ``ros2-testing``. For example, on Ubuntu Jammy the contents should look like the following:
es: Edite (con sudo) el archivo ``/etc/apt/sources.list.d/ros2.list`` y cambie ``ros2`` por ``ros2-testing``. Por ejemplo, en Ubuntu Jammy el contenido debería verse así:

source: Update the ``apt`` index:
es: Actualice el índice ``apt``:

source: You can now install individual packages from the testing repository, for example:
es: Ahora puede instalar paquetes individuales desde el repositorio de pruebas, por ejemplo:

source: Alternatively, you can move your entire ROS 2 installation to the testing repository:
es: Alternativamente, puede mover toda su instalación de ROS 2 al repositorio de pruebas:

source: Once you are finished testing, you can switch back to the normal repository by changing back the contents of ``/etc/apt/sources.list.d/ros2.list``:
es: Una vez que haya terminado de probar, puede volver al repositorio normal cambiando el contenido de ``/etc/apt/sources.list.d/ros2.list``:

source: and doing an update and upgrade:
es: y hacer una actualización y actualización:

source: Fat binaries
es: Binarios fat

source: For core packages, we run nightly packaging jobs for Ubuntu Linux, RHEL, and Windows. These packaging jobs produce archives with pre-built binaries that can be downloaded and extracted to your filesystem.
es: Para paquetes básicos, ejecutamos trabajos de empaquetado nocturnos para Ubuntu Linux, RHEL y Windows. Estos trabajos de empaquetado producen archivos con binarios precompilados que se pueden descargar y extraer en su sistema de archivos.

source: Make sure you have all dependencies installed according to the :doc:`latest development setup <Alternatives/Latest-Development-Setup>` for your platform.
es: Asegúrese de tener todas las dependencias instaladas de acuerdo con la :doc:`última configuración de desarrollo <Alternatives/Latest-Development-Setup>` para su plataforma.

source: Go to https://ci.ros2.org/view/packaging/ and select a packaging job from the list corresponding to your platform.
es: Vaya a https://ci.ros2.org/view/packaging/ y seleccione un trabajo de empaquetado de la lista correspondiente a su plataforma.

source: Under the heading "Last Successful Artifacts" you should see a download link (e.g. for Windows, ``ros2-package-windows-AMD64.zip``).
es: En el encabezado "Últimos artefactos exitosos" debería ver un enlace de descarga (por ejemplo, para Windows, ``ros2-package-windows-AMD64.zip``).

source: Download and extract the archive to your file system.
es: Descargue y extraiga el archivo en su sistema de archivos.

source: To use the fat binary installation, source the ``setup.*`` file that can be found in the root of the archive.
es: Para usar la instalación de binarios gordos, use el archivo ``setup.*`` que se puede encontrar en la raíz del archivo.

source: Ubuntu Linux and RHEL
es: Ubuntu Linux y RHEL

source: For Ubuntu Linux, there is also a nightly Docker image based on the nightly fat archive.
es: Para Ubuntu Linux, también hay una imagen Docker diaria basada en el archivo fat diario.

source: Pull the Docker image:
es: Extraiga la imagen de Docker:

source: Start an interactive container:
es: Inicie un contenedor interactivo:

source: For support on running GUI applications in Docker, take a look at the tutorial `User GUI's with Docker <https://wiki.ros.org/docker/Tutorials/GUI>`_ or the tool `rocker <https://github.com/osrf/rocker>`_.
es: Para obtener soporte sobre cómo ejecutar aplicaciones GUI en Docker, eche un vistazo al tutorial `User GUI's with Docker <https://wiki.ros.org/docker/Tutorials/GUI>`_ o la herramienta `rocker <https://github.com/osrf/rocker>`_.

source: Ubuntu (Debian packages)
es: Ubuntu (paquetes Debian)

source: Debian packages for ROS 2 {DISTRO_TITLE_FULL} are currently available for Ubuntu Jammy. The Rolling Ridley distribution will change target platforms from time to time as new platforms are selected for development. The target platforms are defined in `REP 2000 <https://github.com/ros-infrastructure/rep/blob/master/rep-2000.rst>`__ Most people will want to use a stable ROS distribution.
es: Los paquetes Debian para ROS 2 {DISTRO_TITLE_FULL} están disponibles actualmente para Ubuntu Jammy. La distribución Rolling Ridley cambiará las plataformas objetivo de vez en cuando a medida que se seleccionen nuevas plataformas para el desarrollo. Las plataformas objetivo se definen en `REP 2000 <https://github.com/ros-infrastructure/rep/blob/master/rep-2000.rst>`__ La mayoría de las personas querrán usar una distribución ROS estable.

source: Update your apt repository caches after setting up the repositories.
es: Actualice las cachés de su repositorio apt después de configurar los repositorios.

source: Due to early updates in Ubuntu 22.04 it is important that ``systemd`` and ``udev``-related packages are updated before installing ROS 2. The installation of ROS 2's dependencies on a freshly installed system without upgrading can trigger the **removal of critical system packages**.
es: Debido a las actualizaciones tempranas en Ubuntu 22.04, es importante que los paquetes relacionados con ``systemd`` y ``udev`` se actualicen antes de instalar ROS 2. La instalación de las dependencias de ROS 2 en un sistema recién instalado sin actualizar puede desencadenar la **eliminación de paquetes críticos del sistema**.

source: Please refer to `ros2/ros2#1272 <https://github.com/ros2/ros2/issues/1272>`_ and `Launchpad #1974196 <https://bugs.launchpad.net/ubuntu/+source/systemd/+bug/1974196>`_ for more information.
es: Consulte `ros2/ros2#1272 <https://github.com/ros2/ros2/issues/1272>`_ y `Launchpad #1974196 <https://bugs.launchpad.net/ubuntu/+source/systemd/+bug/1974196>`_ para obtener más información.

source: You may also want to remove the repository:
es: También puede querer eliminar el repositorio:

source: Windows (binary)
es: Windows (binario)
