Repository: ros2/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Installation.po
Languages: es

source: Installation
es: Instalación

source: Options for installing ROS 2 {DISTRO_TITLE_FULL}:
es: Opciones para instalar ROS 2 {DISTRO_TITLE_FULL}:

source: Binary packages
es: Paquetes binarios

source: Binaries are only created for the Tier 1 operating systems listed in `REP-2000 <https://www.ros.org/reps/rep-2000.html#rolling-ridley-june-2020-ongoing>`__. Given the nature of Rolling, this list may be updated at any time. If you are not running any of the following operating systems you may need to build from source or use a :doc:`container solution <How-To-Guides/Run-2-nodes-in-single-or-separate-docker-containers>` to run ROS 2 on your platform.
es: Los binarios solo se crean para los sistemas operativos de nivel 1 enumerados en `REP-2000 <https://www.ros.org/reps/rep-2000.html#rolling-ridley-june-2020-ongoing>`__. Dada la naturaleza de Rolling, esta lista puede actualizarse en cualquier momento. Si no está ejecutando ninguno de los siguientes sistemas operativos, es posible que deba compilar desde origen o utilizar una :doc:`solución de contenedor <How-To-Guides/Run-2-nodes-in-single-or-separate-docker-containers>` para ejecutar ROS 2 en su plataforma.

source: We provide ROS 2 binary packages for the following platforms:
es: Proporcionamos paquetes binarios de ROS 2 para las siguientes plataformas:

source: :doc:`Debian packages <Installation/Ubuntu-Install-Debians>` (recommended)
es: :doc:`Paquetes Debian <Installation/Ubuntu-Install-Debians>` (recomendado)

source: :doc:`"fat" archive <Installation/Alternatives/Ubuntu-Install-Binary>`
es: :doc:`Archivo "fat" <Installation/Alternatives/Ubuntu-Install-Binary>`

source: :doc:`RPM packages <Installation/RHEL-Install-RPMs>` (recommended)
es: :doc:`Paquetes RPM <Installation/RHEL-Install-RPMs>` (recomendado)

source: :doc:`"fat" archive <Installation/Alternatives/RHEL-Install-Binary>`
es: :doc:`Archivo "fat" <Installation/Alternatives/RHEL-Install-Binary>`

source: Building from source
es: Compilación desde el código fuente

source: We support building ROS 2 from source on the following platforms:
es: Admitimos la compilación de ROS 2 desde el código fuente en las siguientes plataformas:

source: Which install should you choose?
es: ¿Qué instalación debería elegir?

source: Installing from binary packages or from source will both result in a fully-functional and usable ROS 2 install. Differences between the options depend on what you plan to do with ROS 2.
es: La instalación desde paquetes binarios o desde el código fuente dará como resultado una instalación de ROS 2 totalmente funcional y utilizable. Las diferencias entre las opciones dependen de lo que planea hacer con ROS 2.

source: **Binary packages** are for general use and provide an already-built install of ROS 2. This is great for people who want to dive in and start using ROS 2 as-is, right away.
es: **Los paquetes binarios** son para uso general y proporcionan una instalación ya construida de ROS 2. Esto es genial para las personas que desean sumergirse y comenzar a usar ROS 2 tal como está, de inmediato.

source: Linux users have two options for installing binary packages:
es: Los usuarios de Linux tienen dos opciones para instalar paquetes binarios:

source: Debian packages
es: Paquetes Debian

source: "fat" archive
es: Archivo "fat"

source: Installing from Debian packages is the recommended method. It's more convenient because it installs its necessary dependencies automatically. It also updates alongside regular system updates.
es: La instalación desde paquetes Debian es el método recomendado. Es más conveniente porque instala sus dependencias necesarias automáticamente. También se actualiza junto con las actualizaciones regulares del sistema.

source: However, you need root access in order to install Debian packages. If you don't have root access, the "fat" archive is the next best choice.
es: Sin embargo, necesita acceso de root para instalar paquetes Debian. Si no tiene acceso de root, el archivo "fat" es la siguiente mejor opción.

source: macOS and Windows users who choose to install from binary packages only have the "fat" archive option (Debian packages are exclusive to Ubuntu/Debian).
es: Los usuarios de macOS y Windows que eligen instalar desde paquetes binarios solo tienen la opción del archivo "fat" (los paquetes Debian son exclusivos de Ubuntu/Debian).

source: **Building from source** is meant for developers looking to alter or explicitly omit parts of ROS 2's base. It is also recommended for platforms that don't support binaries. Building from source also gives you the option to install the absolute latest version of ROS 2.
es: **La compilación desde el código fuente** está destinada a desarrolladores que buscan alterar u omitir explícitamente partes de la base de ROS 2. También se recomienda para plataformas que no admiten binarios. La compilación desde el código fuente también le brinda la opción de instalar la última versión absoluta de ROS 2.

source: Contributing to ROS 2 core?
es: ¿Contribuir al núcleo de ROS 2?

source: If you plan to contribute directly to ROS 2 core packages, you can install the :doc:`latest development from source <Installation/Alternatives/Latest-Development-Setup>` which shares installation instructions with the :ref:`Rolling distribution <rolling_distribution>`.
es: Si planea contribuir directamente a los paquetes principales de ROS 2, puede instalar la :doc:`última versión de desarrollo desde el código fuente <Installation/Alternatives/Latest-Development-Setup>` que comparte instrucciones de instalación con la :ref:`distribución Rolling <rolling_distribution>`.

source: Alternatives
es: Alternativas

source: A list of alternative ways to install ROS 2 – whether it's by building from source or installing a binary.
es: Una lista de formas alternativas de instalar ROS 2, ya sea compilando desde el código fuente o instalando un binario.

source: Latest development (source)
es: Último desarrollo (código fuente)

source: If you plan to contribute directly to the latest ROS 2 development, you can install ROS 2 by building it from source or installing testing binaries. This will give you the latest bug fixes and features.
es: Si planea contribuir directamente al último desarrollo de ROS 2, puede instalar ROS 2 compilándolo desde el código fuente o instalando binarios de prueba. Esto le dará las últimas correcciones de errores y funciones.

source: Testing binaries
es: Binarios de prueba

source: See :doc:`Testing <../Testing>`.
es: Ver :doc:`Pruebas <../Testing>`.

source: Build from source
es: Compilar desde el código fuente

source: The latest development does not go through the same rigorous testing as releases and is not recommended if you are looking for a stable version of ROS 2. Instead, choose a :doc:`ROS distribution <../../Installation>` that has already been released.
es: El último desarrollo no pasa por las mismas pruebas rigurosas que las versiones y no se recomienda si está buscando una versión estable de ROS 2. En su lugar, elija una :doc:`distribución de ROS <../../Installation>` que ya haya sido lanzada.

source: Follow the links below for the latest setup instructions for your platform:
es: Siga los enlaces a continuación para obtener las últimas instrucciones de configuración para su plataforma:

source: For keeping your source code up-to-date, see :doc:`Maintain a source checkout <../Maintaining-a-Source-Checkout>`.
es: Para mantener actualizado su código fuente, consulte :doc:`Mantener un repositorio de código fuente <../Maintaining-a-Source-Checkout>`.

source: RHEL (source)
es: RHEL (código fuente)

source: Table of Contents
es: Tabla de contenidos

source: System requirements
es: Requisitos del sistema

source: The current target Red Hat platforms for {DISTRO_TITLE_FULL} are:
es: Las plataformas Red Hat objetivo actuales para {DISTRO_TITLE_FULL} son:

source: Tier 2: RHEL 9 64-bit
es: Nivel 2: RHEL 9 de 64 bits

source: As defined in `REP 2000 <https://www.ros.org/reps/rep-2000.html>`_.
es: Como se define en `REP 2000 <https://www.ros.org/reps/rep-2000.html>`_.

source: System setup
es: Configuración del sistema

source: Set locale
es: Establecer configuración regional

source: Make sure you have a locale which supports ``UTF-8``. If you are in a minimal environment (such as a docker container), the locale may be something minimal like ``C``. We test with the following settings. However, it should be fine if you're using a different UTF-8 supported locale.
es: Asegúrese de tener una configuración regional que admita ``UTF-8``. Si está en un entorno mínimo (como un contenedor de Docker), la configuración regional puede ser algo mínimo como ``C``. Probamos con la siguiente configuración. Sin embargo, debería estar bien si está utilizando una configuración regional diferente compatible con UTF-8.

source: Enable required repositories
es: Habilitar los repositorios requeridos

source: The rosdep database contains packages from the EPEL and PowerTools repositories, which are not enabled by default. They can be enabled by running:
es: La base de datos de rosdep contiene paquetes de los repositorios EPEL y PowerTools, que no están habilitados de forma predeterminada. Se pueden habilitar ejecutando:

source: This step may be slightly different depending on the distribution you are using. Check the EPEL documentation: https://docs.fedoraproject.org/en-US/epel/#_quickstart
es: Este paso puede ser ligeramente diferente según la distribución que esté utilizando. Consulte la documentación de EPEL: https://docs.fedoraproject.org/en-US/epel/#_quickstart

source: No additional setup required.
es: No se requiere configuración adicional.

source: Install development tools
es: Instalar herramientas de desarrollo

source: Build ROS 2
es: Compilar ROS 2

source: Get ROS 2 code
es: Obtener el código de ROS 2

source: Create a workspace and clone all repos:
es: Cree un espacio de trabajo y clone todos los repositorios:

source: Install dependencies using rosdep
es: Instalar dependencias usando rosdep

source: ROS 2 packages are built on frequently updated RHEL systems. It is always recommended that you ensure your system is up to date before installing new packages.
es: Los paquetes de ROS 2 se compilan en sistemas RHEL actualizados con frecuencia. Siempre se recomienda que asegure que su sistema esté actualizado antes de instalar nuevos paquetes.

source: Install additional RMW implementations (optional)
es: Instalar implementaciones RMW adicionales (opcional)

source: The default middleware that ROS 2 uses is ``Fast DDS``, but the middleware (RMW) can be replaced at build or runtime. See the :doc:`guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` on how to work with multiple RMWs.
es: El middleware predeterminado que usa ROS 2 es ``Fast DDS``, pero el middleware (RMW) se puede reemplazar en tiempo de compilación o de ejecución. Consulte la :doc:`guía <../../How-To-Guides/Working-with-multiple-RMW-implementations>` sobre cómo trabajar con múltiples RMW.

source: Build the code in the workspace
es: Compilar el código en el espacio de trabajo

source: If you have already installed ROS 2 another way (either via RPMs or the binary distribution), make sure that you run the below commands in a fresh environment that does not have those other installations sourced. Also ensure that you do not have ``source /opt/ros/${ROS_DISTRO}/setup.bash`` in your ``.bashrc``. You can make sure that ROS 2 is not sourced with the command ``printenv | grep -i ROS``. The output should be empty.
es: Si ya ha instalado ROS 2 de otra manera (ya sea a través de RPM o la distribución binaria), asegúrese de ejecutar los siguientes comandos en un entorno nuevo que no tenga esas otras instalaciones. Asegúrese también de no tener ``source /opt/ros/${ROS_DISTRO}/setup.bash`` en su ``.bashrc``. Puede asegurarse de que ROS 2 no esté en uso con el comando ``printenv | grep -i ROS``. La salida debería estar vacía.

source: More info on working with a ROS workspace can be found in :doc:`this tutorial <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`.
es: Puede encontrar más información sobre cómo trabajar con un espacio de trabajo de ROS en :doc:`este tutorial <../../Tutorials/Beginner-Client-Libraries/Colcon-Tutorial>`.

source: If you are having trouble compiling all examples and this is preventing you from completing a successful build, you can use the ``--packages-skip`` colcon flag to ignore the package that is causing problems. For instance, if you don't want to install the large OpenCV library, you could skip building the packages that depend on it using the command:
es: Si tiene problemas para compilar todos los ejemplos y esto le impide completar una compilación exitosa, puede usar la bandera ``--packages-skip`` de colcon para ignorar el paquete que está causando problemas. Por ejemplo, si no desea instalar la gran biblioteca OpenCV, podría omitir la compilación de los paquetes que dependen de ella usando el comando:

source: Setup environment
es: Configurar el entorno

source: Set up your environment by sourcing the following file.
es: Configure su entorno mediante el siguiente archivo.

source: Try some examples
es: Pruebe algunos ejemplos

source: In one terminal, source the setup file and then run a C++ ``talker``\ :
es: En una terminal, ejecute el archivo de configuración y luego ejecute un ``talker`` de C++\ :

source: In another terminal source the setup file and then run a Python ``listener``\ :
es: En otra terminal, ejecute el archivo de configuración y luego ejecute un ``listener`` de Python\ :

source: You should see the ``talker`` saying that it's ``Publishing`` messages and the ``listener`` saying ``I heard`` those messages. This verifies both the C++ and Python APIs are working properly. Hooray!
es: Debería ver que el ``talker`` dice que está publicando (``Publishing``) mensajes y el ``listener`` dice que escuchó (``I heard``) esos mensajes. Esto verifica que tanto las API de C++ como de Python funcionan correctamente. ¡Hurra!

source: Next steps
es: Siguientes pasos

source: Continue with the :doc:`tutorials and demos <../../Tutorials>` to configure your environment, create your own workspace and packages, and learn ROS 2 core concepts.
es: Continúe con los :doc:`tutoriales y demostraciones <../../Tutorials>` para configurar su entorno, crear su propio espacio de trabajo y paquetes, y aprender los conceptos básicos de ROS 2.

source: Alternate compilers
es: Compiladores alternativos

source: Using a different compiler besides gcc to compile ROS 2 is easy. If you set the environment variables ``CC`` and ``CXX`` to executables for a working C and C++ compiler, respectively, and retrigger CMake configuration (by using ``--force-cmake-config`` or by deleting the packages you want to be affected), CMake will reconfigure and use the different compiler.
es: Usar un compilador diferente a gcc para compilar ROS 2 es fácil. Si configura las variables de entorno ``CC`` y ``CXX`` para ejecutar un compilador C y C++ que funcione, respectivamente, y vuelve a activar la configuración de CMake (usando ``--force-cmake-config`` o eliminando los paquetes que desea que se vean afectados), CMake volverá a configurar y usará el compilador diferente.

source: To configure CMake to detect and use Clang:
es: Para configurar CMake para detectar y usar Clang:

source: Stay up to date
es: Manténgase actualizado

source: See :doc:`../Maintaining-a-Source-Checkout` to periodically refresh your source installation.
es: Consulte :doc:`../Maintaining-a-Source-Checkout` para actualizar periódicamente su instalación de código fuente.

source: Troubleshoot
es: Solucionar problemas

source: Troubleshooting techniques can be found :ref:`here <linux-troubleshooting>`.
es: Las técnicas de solución de problemas se pueden encontrar :ref:`aquí <linux-troubleshooting>`.

source: Uninstall
es: Desinstalar

source: If you installed your workspace with colcon as instructed above, "uninstalling" could be just a matter of opening a new terminal and not sourcing the workspace's ``setup`` file. This way, your environment will behave as though there is no {DISTRO_TITLE} install on your system.
es: Si instaló su espacio de trabajo con colcon como se indica arriba, "desinstalar" podría ser solo una cuestión de abrir una nueva terminal y no ejecutar el archivo ``setup`` del espacio de trabajo. De esta manera, su entorno se comportará como si no hubiera una instalación de {DISTRO_TITLE} en su sistema.

source: If you're also trying to free up space, you can delete the entire workspace directory with:
es: Si también está intentando liberar espacio, puede eliminar todo el directorio del espacio de trabajo con:

source: RHEL (binary)
es: RHEL (binario)

source: This page explains how to install ROS 2 on RHEL from a pre-built binary package.
es: Esta página explica cómo instalar ROS 2 en RHEL desde un paquete binario precompilado.

source: The pre-built binary does not include all ROS 2 packages. All packages in the `ROS base variant <https://ros.org/reps/rep-2001.html#ros-base>`_ are included, and only a subset of packages in the `ROS desktop variant <https://ros.org/reps/rep-2001.html#desktop-variants>`_ are included. The exact list of packages are described by the repositories listed in `this ros2.repos file <https://github.com/ros2/ros2/blob/{REPOS_FILE_BRANCH}/ros2.repos>`_.
es: El binario precompilado no incluye todos los paquetes de ROS 2. Se incluyen todos los paquetes en la `variante base de ROS <https://ros.org/reps/rep-2001.html#ros-base>`_ y solo se incluye un subconjunto de paquetes en la `variante de escritorio de ROS <https://ros.org/reps/rep-2001.html#desktop-variants>`_. La lista exacta de paquetes está descrita por los repositorios enumerados en `este archivo ros2.repos <https://github.com/ros2/ros2/blob/{REPOS_FILE_BRANCH}/ros2.repos>`_.

source: There are also :doc:`RPM packages <../RHEL-Install-RPMs>` available.
es: También hay :doc:`paquetes RPM <../RHEL-Install-RPMs>` disponibles.

source: We currently support RHEL 9 64-bit. The Rolling Ridley distribution will change target platforms from time to time as new platforms are selected for development. Most people will want to use a stable ROS distribution.
es: Actualmente admitimos RHEL 9 de 64 bits. La distribución Rolling Ridley cambiará las plataformas objetivo de vez en cuando a medida que se seleccionen nuevas plataformas para el desarrollo. La mayoría de las personas querrán usar una distribución ROS estable.

source: Install prerequisites
es: Instalar prerrequisitos

source: There are a few packages that must be installed in order to get and unpack the binary release.
es: Hay algunos paquetes que deben instalarse para obtener y descomprimir la versión binaria.

source: Install development tools (optional)
es: Instalar herramientas de desarrollo (opcional)

source: If you are going to build ROS packages or otherwise do development, you can also install the development tools:
es: Si va a compilar paquetes ROS o de otro modo hacer desarrollo, también puede instalar las herramientas de desarrollo:

source: Install ROS 2
es: Instalar ROS 2

source: Binary releases of Rolling Ridley are not provided. Instead you may download nightly :ref:`prerelease binaries <Prerelease_binaries>`.
es: No se proporcionan versiones binarias de Rolling Ridley. En su lugar, puede descargar versiones diarias :ref:`binarias de prelanzamiento <Prerelease_binaries>`.

source: Download the latest package for RHEL; let's assume that it ends up at ``~/Downloads/ros2-package-linux-x86_64.tar.bz2``.
es: Descargue el último paquete para RHEL; supongamos que termina en ``~/Downloads/ros2-package-linux-x86_64.tar.bz2``.

source: Note: there may be more than one binary download option which might cause the file name to differ.
es: Nota: puede haber más de una opción de descarga binaria que puede hacer que el nombre del archivo sea diferente.

source: Unpack it:
es: Descomprímalo:

source: The default middleware that ROS 2 uses is ``Fast DDS``, but the middleware (RMW) can be replaced at runtime. See the :doc:`guide <../../How-To-Guides/Working-with-multiple-RMW-implementations>` on how to work with multiple RMWs.
es: El middleware predeterminado que usa ROS 2 es ``Fast DDS``, pero el middleware (RMW) se puede reemplazar en tiempo de ejecución. Consulte la :doc:`guía <../../How-To-Guides/Working-with-multiple-RMW-implementations>` sobre cómo trabajar con múltiples RMW.

source: In one terminal, source the setup file and then run a C++ ``talker``:
es: En una terminal, ejecute el archivo de configuración y luego ejecute un ``talker`` de C++:

source: In another terminal source the setup file and then run a Python ``listener``:
es: En otra terminal, ejecute el archivo de configuración y luego ejecute un ``listener`` de Python:

source: Troubleshooting techniques can be found :doc:`here <../../How-To-Guides/Installation-Troubleshooting>`.
es: Las técnicas de solución de problemas se pueden encontrar :doc:`aquí <../../How-To-Guides/Installation-Troubleshooting>`.

source: Ubuntu (source)
es: Ubuntu (código fuente)

source: The current Debian-based target platforms for {DISTRO_TITLE_FULL} are:
es: Las plataformas objetivo basadas en Debian actuales para {DISTRO_TITLE_FULL} son:

source: Tier 1: Ubuntu Linux - Jammy (22.04) 64-bit
es: Nivel 1: Ubuntu Linux - Jammy (22.04) de 64 bits

source: Tier 3: Debian Linux - Bullseye (11) 64-bit
es: Nivel 3: Debian Linux - Bullseye (11) de 64 bits

source: Make sure you have a locale which supports ``UTF-8``. If you are in a minimal environment (such as a docker container), the locale may be something minimal like ``POSIX``. We test with the following settings. However, it should be fine if you're using a different UTF-8 supported locale.
es: Asegúrese de tener una configuración regional que admita ``UTF-8``. Si está en un entorno mínimo (como un contenedor de Docker), la configuración regional puede ser algo mínimo como ``POSIX``. Probamos con la siguiente configuración. Sin embargo, debería estar bien si está utilizando una configuración regional diferente compatible con UTF-8.

source: You will need to add the ROS 2 apt repository to your system.
es: Necesitará agregar el repositorio apt de ROS 2 a su sistema.

source: First ensure that the `Ubuntu Universe repository <https://help.ubuntu.com/community/Repositories/Ubuntu>`_ is enabled.
es: Primero asegúrese de que el `repositorio del universo de Ubuntu <https://help.ubuntu.com/community/Repositories/Ubuntu>`_ esté habilitado.

source: Now add the ROS 2 GPG key with apt.
es: Ahora agregue la clave GPG de ROS 2 con apt.

source: Then add the repository to your sources list.
es: Luego agregue el repositorio a su lista de fuentes.

source: ROS 2 packages are built on frequently updated Ubuntu systems. It is always recommended that you ensure your system is up to date before installing new packages.
es: Los paquetes ROS 2 se construyen en sistemas Ubuntu actualizados con frecuencia. Siempre se recomienda que asegure que su sistema esté actualizado antes de instalar nuevos paquetes.

source: **Note**: If you're using a distribution that is based on Ubuntu (like Linux Mint) but does not identify itself as such, you'll get an error message like ``Unsupported OS [mint]``. In this case append ``--os=ubuntu:jammy`` to the above command.
es: **Nota**: si está utilizando una distribución basada en Ubuntu (como Linux Mint) pero no se identifica como tal, recibirá un mensaje de error como ``Unsupported OS [mint]``. En este caso, agregue ``--os=ubuntu:jammy`` al comando anterior.
