Repository: ros2/ros2_documentation
Catalog: locale/*/LC_MESSAGES/Installation.po
Languages: es

source: If you have already installed ROS 2 another way (either via Debians or the binary distribution), make sure that you run the below commands in a fresh environment that does not have those other installations sourced. Also ensure that you do not have ``source /opt/ros/${ROS_DISTRO}/setup.bash`` in your ``.bashrc``. You can make sure that ROS 2 is not sourced with the command ``printenv | grep -i ROS``. The output should be empty.
es: Si ya ha instalado ROS 2 de otra manera (ya sea a través de Debians o la distribución binaria), asegúrese de ejecutar los siguientes comandos en un entorno nuevo que no tenga esas otras instalaciones. Asegúrese también de no tener ``source /opt/ros/${ROS_DISTRO}/setup.bash`` en su ``.bashrc``. Puede asegurarse de que ROS 2 no esté en uso con el comando ``printenv | grep -i ROS``. La salida debería estar vacía.

source: Use the ROS 1 bridge (optional)
es: Usar el puente ROS 1 (opcional)

source: The ROS 1 bridge can connect topics from ROS 1 to ROS 2 and vice-versa. See the dedicated :doc:`document <../../How-To-Guides/Using-ros1_bridge-Jammy-upstream>` on how to build and use the ROS 1 bridge.
es: El puente ROS 1 puede conectar temas de ROS 1 a ROS 2 y viceversa. Vea el :doc:`documento dedicado <../../How-To-Guides/Using-ros1_bridge-Jammy-upstream>` sobre cómo construir y usar el puente ROS 1.

source: Ubuntu (binary)
es: Ubuntu (binario)

source: This page explains how to install ROS 2 on Ubuntu Linux from a pre-built binary package.
es: Esta página explica cómo instalar ROS 2 en Ubuntu Linux desde un paquete

source: There are also :doc:`Debian packages <../Ubuntu-Install-Debians>` available.
es: También hay :doc:`paquetes Debian <../Ubuntu-Install-Debians>` disponibles.

source: We currently support Ubuntu Linux Jammy (22.04) 64-bit x86 and 64-bit ARM. The Rolling Ridley distribution will change target platforms from time to time as new platforms are selected for development. Most people will want to use a stable ROS distribution.
es: Actualmente admitimos Ubuntu Linux Jammy (22.04) de 64 bits x86 y de 64 bits ARM. La distribución Rolling Ridley cambiará las plataformas objetivo de vez en cuando a medida que se seleccionen nuevas plataformas para el desarrollo. La mayoría de las personas querrán usar una distribución ROS estable.

source: Download the latest package for Ubuntu; let's assume that it ends up at ``~/Downloads/ros2-package-linux-x86_64.tar.bz2``.
es: Descargue el último paquete para Ubuntu; supongamos que termina en ``~/Downloads/ros2-package-linux-x86_64.tar.bz2``.

source: Windows (source)
es: Windows (código fuente)

source: This guide is about how to setup a development environment for ROS 2 on Windows.
es: Esta guía trata sobre cómo configurar un entorno de desarrollo para ROS 2 en Windows.

source: Only Windows 10 is supported.
es: Solo se admite Windows 10.

source: Language support
es: Soporte de idiomas

source: Make sure you have a locale which supports ``UTF-8``. For example, for a Chinese-language Windows 10 installation, you may need to install an `English language pack <https://support.microsoft.com/en-us/windows/language-packs-for-windows-a5094319-a92d-18de-5b53-1cfc697cfca8>`_.
es: Asegúrese de tener una configuración regional que admita ``UTF-8``. Por ejemplo, para una instalación de Windows 10 en chino, es posible que deba instalar un `paquete de idioma inglés <https://support.microsoft.com/es-es/windows/paquetes-de-idioma-para-windows-a5094319-a92d-18de-5b53-1cfc697cfca8>`_.

source: Install Chocolatey
es: Instalar Chocolatey

source: Chocolatey is a package manager for Windows, install it by following their installation instructions:
es: Chocolatey es un administrador de paquetes para Windows, instálelo siguiendo sus instrucciones de instalación:

source: You'll use Chocolatey to install some other developer tools.
es: Usará Chocolatey para instalar algunas otras herramientas de desarrollo.

source: Install Python
es: Instalar Python

source: Open a Command Prompt and type the following to install Python via Chocolatey:
es: Abra un símbolo del sistema y escriba lo siguiente para instalar Python a través de Chocolatey:

source: Install Visual C++ Redistributables
es: Instalar redistribuibles de Visual C++

source: Open a Command Prompt and type the following to install them via Chocolatey:
es: Abra un símbolo del sistema y escriba lo siguiente para instalarlos a través de Chocolatey:

source: Install OpenSSL
es: Instalar OpenSSL

source: Download the *Win64 OpenSSL v1.1.1n* OpenSSL installer from `this page <https://slproweb.com/products/Win32OpenSSL.html>`__. Scroll to the bottom of the page and download *Win64 OpenSSL v1.1.1t*. Don't download the Win32 or Light versions, or the v3.X.Y installers.
es: Descargue el instalador de OpenSSL *Win64 OpenSSL v1.1.1n* de `esta página <https://slproweb.com/products/Win32OpenSSL.html>`__. Desplácese hasta la parte inferior de la página y descargue *Win64 OpenSSL v1.1.1t*. No descargue las versiones Win32 o Light, ni los instaladores v3.X.Y.

source: Run the installer with default parameters, as the following commands assume you used the default installation directory.
es: Ejecute el instalador con los parámetros predeterminados, ya que los siguientes comandos asumen que utilizó el directorio de instalación predeterminado.

source: This command sets an environment variable that persists over sessions:
es: Este comando establece una variable de entorno que persiste en las sesiones:

source: You will need to append the OpenSSL-Win64 bin folder to your PATH. You can do this by clicking the Windows icon, typing "Environment Variables", then clicking on "Edit the system environment variables". In the resulting dialog, click "Environment Variables", then click "Path" on the bottom pane, finally click "Edit" and add the path below.
es: Deberá agregar la carpeta bin de OpenSSL-Win64 a su PATH. Puede hacerlo haciendo clic en el icono de Windows, escribiendo "Variables de entorno", luego haciendo clic en "Editar las variables de entorno del sistema". En el cuadro de diálogo resultante, haga clic en "Variables de entorno", luego haga clic en "Path" en el panel inferior, finalmente haga clic en "Editar" y agregue la ruta a continuación.

source: Install Visual Studio
es: Instalar Visual Studio

source: Install Visual Studio 2019.
es: Instale Visual Studio 2019.

source: If you already have a paid version of Visual Studio 2019 (Professional, Enterprise), skip this step.
es: Si ya tiene una versión de pago de Visual Studio 2019 (Professional, Enterprise), omita este paso.

source: Microsoft provides a free of charge version of Visual Studio 2019, named Community, which can be used to build applications that use ROS 2. `You can download the installer directly through this link. <https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=Community&rel=16&src=myvs&utm_medium=microsoft&utm_source=my.visualstudio.com&utm_campaign=download&utm_content=vs+community+2019>`_
es: Microsoft proporciona una versión gratuita de Visual Studio 2019, llamada Community, que se puede usar para compilar aplicaciones que usan ROS 2. `Puede descargar el instalador directamente a través de este enlace. <https://visualstudio.microsoft.com/thank-you-downloading-visual-studio/?sku=Community&rel=16&src=myvs&utm_medium=microsoft&utm_source=my.visualstudio.com&utm_campaign=download&utm_content=vs+community+2019>`_

source: Make sure that the Visual C++ features are installed.
es: Asegúrese de que las características de Visual C++ estén instaladas.

source: An easy way to make sure they're installed is to select the ``Desktop development with C++`` workflow during the install.
es: Una forma sencilla de asegurarse de que estén instalados es seleccionar el flujo de trabajo ``Desarrollo de escritorio con C++`` durante la instalación.

source: Make sure that no C++ CMake tools are installed by unselecting them in the list of components to be installed.
es: Asegúrese de que no se instalen herramientas CMake de C++ desmarcándolas en la lista de componentes que se van a instalar.

source: Install OpenCV
es: Instalar OpenCV

source: Some of the examples require OpenCV to be installed.
es: Algunos de los ejemplos requieren que se instale OpenCV.

source: You can download a precompiled version of OpenCV 3.4.6 from https://github.com/ros2/ros2/releases/download/opencv-archives/opencv-3.4.6-vc16.VS2019.zip .
es: Puede descargar una versión precompilada de OpenCV 3.4.6 desde https://github.com/ros2/ros2/releases/download/opencv-archives/opencv-3.4.6-vc16.VS2019.zip .

source: Assuming you unpacked it to ``C:\opencv``, type the following on a Command Prompt (requires Admin privileges):
es: Suponiendo que lo desempaquetó en ``C:\opencv``, escriba lo siguiente en un símbolo del sistema (requiere privilegios de administrador):

source: Since you are using a precompiled ROS version, we have to tell it where to find the OpenCV libraries. You have to extend the ``PATH`` variable to ``C:\opencv\x64\vc16\bin``.
es: Dado que está utilizando una versión de ROS precompilada, tenemos que indicarle dónde encontrar las bibliotecas OpenCV. Debe extender la variable ``PATH`` a ``C:\opencv\x64\vc16\bin``.

source: Install dependencies
es: Instalar dependencias

source: There are a few dependencies not available in the Chocolatey package database. In order to ease the manual installation process, we provide the necessary Chocolatey packages.
es: Hay algunas dependencias que no están disponibles en la base de datos de paquetes Chocolatey. Para facilitar el proceso de instalación manual, proporcionamos los paquetes Chocolatey necesarios.

source: As some chocolatey packages rely on it, we start by installing CMake
es: Como algunos paquetes de chocolatey dependen de él, comenzamos instalando CMake

source: You will need to append the CMake bin folder ``C:\Program Files\CMake\bin`` to your PATH.
es: Necesitará agregar la carpeta bin de CMake ``C:\Program Files\CMake\bin`` a su PATH.

source: Please download these packages from `this <https://github.com/ros2/choco-packages/releases/latest>`__ GitHub repository.
es: Descargue estos paquetes de `este <https://github.com/ros2/choco-packages/releases/latest>`__ repositorio de GitHub.

source: Once these packages are downloaded, open an administrative shell and execute the following command:
es: Una vez que se descarguen estos paquetes, abra un shell administrativo y ejecute el siguiente comando:

source: Please replace ``<PATH\TO\DOWNLOADS>`` with the folder you downloaded the packages to.
es: Reemplace ``<PATH\TO\DOWNLOADS>`` con la carpeta en la que descargó los paquetes.

source: First upgrade pip and setuptools:
es: Primero actualice pip y setuptools:

source: Now install some additional python dependencies:
es: Ahora instale algunas dependencias adicionales de python:

source: Install miscellaneous prerequisites
es: Instalar requisitos previos diversos

source: Next install xmllint:
es: A continuación, instale xmllint:

source: Download the `64 bit binary archives <https://www.zlatkovic.com/pub/libxml/64bit/>`__ of ``libxml2`` (and its dependencies ``iconv`` and ``zlib``) from https://www.zlatkovic.com/projects/libxml/
es: Descargue los `archivos binarios de 64 bits <https://www.zlatkovic.com/pub/libxml/64bit/>`__ de ``libxml2`` (y sus dependencias ``iconv`` y ``zlib``) desde https://www.zlatkovic.com/projects/libxml/

source: Unpack all archives into e.g. ``C:\xmllint``
es: Descomprima todos los archivos en p. ej. ``C:\xmllint``

source: Add ``C:\xmllint\bin`` to the ``PATH``.
es: Agregue ``C:\xmllint\bin`` al ``PATH``.

source: Install Qt5
es: Instalar Qt5

source: Download the `5.12.X offline installer <https://www.qt.io/offline-installers>`_ from Qt's website. Run the installer. Make sure to select the ``MSVC 2017 64-bit`` component under the ``Qt`` -> ``Qt 5.12.12`` tree.
es: Descargue el `instalador sin conexión 5.12.X <https://www.qt.io/offline-installers>`_ del sitio web de Qt. Ejecute el instalador. Asegúrese de seleccionar el componente ``MSVC 2017 64-bit`` en el árbol ``Qt`` -> ``Qt 5.12.12``.

source: Finally, in an administrator ``cmd.exe`` window set these environment variables. The commands below assume you installed it to the default location of ``C:\Qt``.
es: Finalmente, en una ventana ``cmd.exe`` de administrador, establezca estas variables de entorno. Los comandos a continuación asumen que lo instaló en la ubicación predeterminada de ``C:\Qt``.

source: This path might change based on the installed MSVC version, the directory Qt was installed to, and the version of Qt installed.
es: Esta ruta puede cambiar según la versión de MSVC instalada, el directorio en el que se instaló Qt y la versión de Qt instalada.

source: RQt dependencies
es: Dependencias de RQt

source: To run rqt_graph you need to `download <https://graphviz.gitlab.io/_pages/Download/Download_windows.html>`__ and install `Graphviz <https://graphviz.gitlab.io/>`__. The installer will ask if to add graphviz to PATH, choose to either add it to the current user or all users.
es: Para ejecutar rqt_graph, debe `descargar <https://graphviz.gitlab.io/_pages/Download/Download_windows.html>`__ e instalar `Graphviz <https://graphviz.gitlab.io/>`__. El instalador preguntará si agregar graphviz a PATH, elija agregarlo al usuario actual o a todos los usuarios.

source: Install additional prerequisites from Chocolatey
es: Instalar requisitos previos adicionales de Chocolatey

source: You will need to append the Git cmd folder ``C:\Program Files\Git\cmd`` to the PATH (you can do this by clicking the Windows icon, typing "Environment Variables", then clicking on "Edit the system environment variables". In the resulting dialog, click "Environment Variables", the click "Path" on the bottom pane, then click "Edit" and add the path).
es: Necesitará agregar la carpeta cmd de Git ``C:\Program Files\Git\cmd`` al PATH (puede hacer esto haciendo clic en el icono de Windows, escribiendo "Variables de entorno", luego haciendo clic en "Editar las variables de entorno del sistema". En el cuadro de diálogo resultante, haga clic en "Variables de entorno", luego haga clic en "Path" en el panel inferior, luego haga clic en "Editar" y agregue la ruta).

source: Install Python prerequisites
es: Instalar prerequisitos de Python

source: Install additional Python dependencies:
es: Instalar dependencias adicionales de Python:

source: Now that we have the development tools we can get the ROS 2 source code.
es: Ahora que tenemos las herramientas de desarrollo, podemos obtener el código fuente de ROS 2.

source: First setup a development folder, for example ``C:\{DISTRO}``:
es: Primero configure una carpeta de desarrollo, por ejemplo ``C:\{DISTRO}``:

source: It is very important that the chosen path is short, due to the short default Windows path limits (260 characters). To allow longer paths, see https://learn.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation?tabs=registry.
es: Es muy importante que la ruta elegida sea corta, debido a los límites de ruta de Windows cortos predeterminados (260 caracteres). Para permitir rutas más largas, consulte https://learn.microsoft.com/en-us/windows/win32/fileio/maximum-file-path-limitation?tabs=registry.

source: Get the ``ros2.repos`` file which defines the repositories to clone from:
es: Obtenga el archivo ``ros2.repos`` que define los repositorios para clonar desde:

source: To build ROS 2 you will need a Visual Studio Command Prompt ("x64 Native Tools Command Prompt for VS 2019") running as Administrator.
es: Para compilar ROS 2, necesitará un símbolo del sistema de Visual Studio ("x64 Native Tools Command Prompt for VS 2019") ejecutándose como administrador.

source: To build the ``\{DISTRO}`` folder tree:
es: Para compilar el árbol de carpetas ``\{DISTRO}`` :

source: We're using ``--merge-install`` here to avoid a ``PATH`` variable that is too long at the end of the build. If you're adapting these instructions to build a smaller workspace then you might be able to use the default behavior which is isolated install, i.e. where each package is installed to a different folder.
es: Estamos usando ``--merge-install`` aquí para evitar una variable ``PATH`` que es demasiado larga al final de la compilación. Si está adaptando estas instrucciones para compilar un espacio de trabajo más pequeño, es posible que pueda usar el comportamiento predeterminado que es una instalación aislada, es decir, donde cada paquete se instala en una carpeta diferente.

source: If you are doing a debug build use ``python_d path\to\colcon_executable`` ``colcon``. See `Extra stuff for debug mode`_ for more info on running Python code in debug builds on Windows.
es: Si está realizando una compilación de depuración, use ``python_d path\to\colcon_executable`` ``colcon``. Consulte `Cosas adicionales para el modo de depuración`_ para obtener más información sobre cómo ejecutar código Python en compilaciones de depuración en Windows.

source: Start a command shell and source the ROS 2 setup file to set up the workspace:
es: Inicie un shell de comandos y ejecute el archivo de configuración de ROS 2 para configurar el espacio de trabajo:

source: This will automatically set up the environment for any DDS vendors that support was built for.
es: Esto configurará automáticamente el entorno para cualquier proveedor de DDS para el que se haya compilado el soporte.

source: It is normal that the previous command, if nothing else went wrong, outputs "The system cannot find the path specified." exactly once.
es: Es normal que el comando anterior, si no hubo ningún otro problema, produzca "El sistema no puede encontrar la ruta especificada." exactamente una vez.

source: Note that the first time you run any executable you will have to allow access to the network through a Windows Firewall popup.
es: Tenga en cuenta que la primera vez que ejecute cualquier ejecutable, deberá permitir el acceso a la red a través de un mensaje emergente del Firewall de Windows.

source: You can run the tests using this command:
es: Puede ejecutar las pruebas usando este comando:

source: ``--merge-install`` should only be used if it was also used in the build step.
es: ``--merge-install`` solo debe usarse si también se usó en el paso de compilación.

source: Afterwards you can get a summary of the tests using this command:
es: Después puede obtener un resumen de las pruebas usando este comando:

source: To run the examples, first open a clean new ``cmd.exe`` and set up the workspace by sourcing the ``local_setup.bat`` file. Then, run a C++ ``talker``\ :
es: Para ejecutar los ejemplos, primero abra un nuevo ``cmd.exe`` limpio y configure el espacio de trabajo mediante la ejecución del archivo ``local_setup.bat``. Luego, ejecute un C++ ``talker``\ :

source: In a separate shell you can do the same, but instead run a Python ``listener``\ :
es: En un shell separado, puede hacer lo mismo, pero en su lugar ejecutar un Python ``listener``\ :

source: It is not recommended to build in the same cmd prompt that you've sourced the ``local_setup.bat``.
es: No se recomienda compilar en el mismo cmd que ha ejecutado el ``local_setup.bat``.

source: Extra stuff for Debug mode
es: Cosas adicionales para el modo de depuración

source: If you want to be able to run all the tests in Debug mode, you'll need to install a few more things:
es: Si desea poder ejecutar todas las pruebas en modo de depuración, necesitará instalar algunas cosas más:

source: To be able to extract the Python source tarball, you can use PeaZip:
es: Para poder extraer el archivo tarball de origen de Python, puede usar PeaZip:

source: You'll also need SVN, since some of the Python source-build dependencies are checked out via SVN:
es: También necesitará SVN, ya que algunas de las dependencias de compilación de origen de Python se verifican a través de SVN:

source: You'll need to quit and restart the command prompt after installing the above.
es: Deberá salir y reiniciar el símbolo del sistema después de instalar lo anterior.

source: Get and extract the Python 3.8.3 source from the ``tgz``:
es: Obtenga y extraiga el origen de Python 3.8.3 de ``tgz``:

source: To keep these instructions concise, please extract it to ``C:\dev\Python-3.8.3``
es: Para mantener estas instrucciones concisas, extráigalas en ``C:\dev\Python-3.8.3``

source: Now, build the Python source in debug mode from a Visual Studio command prompt:
es: Ahora, compile el origen de Python en modo de depuración desde un símbolo del sistema de Visual Studio:

source: Finally, copy the build products into the Python38 installation directories, next to the Release-mode Python executable and DLL's:
es: Finalmente, copie los productos de compilación en los directorios de instalación de Python38, junto con el ejecutable en modo de lanzamiento de Python y las DLL:

source: Now, from a fresh command prompt, make sure that ``python_d`` works:
es: Ahora, desde un símbolo del sistema nuevo, asegúrese de que ``python_d`` funcione:

source: Once you have verified the operation of ``python_d``, it is necessary to reinstall a few dependencies with the debug-enabled libraries:
es: Una vez que haya verificado el funcionamiento de ``python_d``, es necesario volver a instalar algunas dependencias con las bibliotecas habilitadas para depuración:

source: To verify the installation of these dependencies:
es: Para verificar la instalación de estas dependencias:

source: When you wish to return to building release binaries, it is necessary to uninstall the debug variants and use the release variants:
es: Cuando desee volver a compilar binarios de lanzamiento, es necesario desinstalar las variantes de depuración y usar las variantes de lanzamiento:

source: To create executables python scripts(.exe), python_d should be used to invoke colcon
es: Para crear scripts ejecutables de python (.exe), se debe usar python_d para invocar colcon

source: Hooray, you're done!
es: ¡Hurra, has terminado!

source: Troubleshooting techniques can be found :ref:`here <windows-troubleshooting>`.
es: Las técnicas de solución de problemas se pueden encontrar :ref:`aquí <windows-troubleshooting>`.

source: macOS (source)
es: macOS (fuente)

source: We currently support macOS Mojave (10.14). The Rolling Ridley distribution will change target platforms from time to time as new platforms become available. Most people will want to use a stable ROS distribution.
es: Actualmente admitimos macOS Mojave (10.14). La distribución Rolling Ridley cambiará las plataformas de destino de vez en cuando a medida que estén disponibles nuevas plataformas. La mayoría de las personas querrán usar una distribución ROS estable.

source: You need the following things installed to build ROS 2:
es: Necesita las siguientes cosas instaladas para compilar ROS 2:

source: If you don't already have it installed, install [Xcode](https://apps.apple.com/app/xcode/id497799835).
es: Si aún no lo tiene instalado, instale [Xcode](https://apps.apple.com/app/xcode/id497799835).

source: Note: Versions of Xcode later than 11.3.1 can no longer be installed on macOS Mojave, so you will need to install an older version manually, see: https://stackoverflow.com/a/61046761
es: Nota: Las versiones de Xcode posteriores a 11.3.1 ya no se pueden instalar en macOS Mojave, por lo que deberá instalar una versión anterior manualmente, consulte: https://stackoverflow.com/a/61046761

source: Also, if you don't already have it installed, install the Command Line Tools:
es: Además, si aún no lo tiene instalado, instale las Herramientas de línea de comandos:

source: **brew** *(needed to install more stuff; you probably already have this)*:
es: **brew** *(necesario para instalar más cosas; probablemente ya lo tenga)*:
